{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "angle", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"N": {"i": "3"}, "axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "4"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "11"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "5"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "89pSPd6jFb7ezUa+T67ePffl4j2q6xw+qgqhPn3eHD4xxCY+QG6evu/gEz46JpK9IzUHPjc06ryVB6e+yBiuPBDKbT3Bqpa+pcK+viOBFT5ptis9XNyTPTgb6bzzcAK/qomrPdqbWj7K2ie9AH4cPpgFCL4WuMe9m+AOPt/yiLxp1LI+gkOBvtpeAz1DX9M9dtt0vj4IlD1+3+a9PUsrvnv4fL6xhLA8MqotPYmynL7Mgiy92I3oPfAxdL05p+6+vOGHu/KtwT3qQu09lBb9vut1jDwqcJI+JWowvhMoSz1PzHw+IxIou1w00TxO7P+9Ov5gPlpcX77zXfe9UWywPsxksD0xrSS9u7PgvULd+75aNgo+RbXavbo9hD4r0no8W62gPRbjkD6cLfw8unI8vsPvrj234Mq9v6VfvlLMuL63rDc+5BtTvR1sdT4NOX8+uSkJP8Ik5j1GKmO+7hb1vc3aYz5n+Ho+Im8ZPiwoRb67oQw/jdjlvZCnBr8usuo+9a4dvmeoFz2QU5O9PGAqvFijlDyuaLS+2WxtvY2Td76qO6M9B5Mcvsv1ST66kFQ/bG9HvtvDZ70V/oI+NeQ4vpLnVL6r8qM+lDCMvfPrqT6jsYA+TVaAv0Y13LxsKhS+AE3mvmdk376KLzK+yj80vmTlmr6mYuK8Z4zwPrFIuL2lYP48NCLhvZ9xGj6FFsE9+uetvWXvOL4drgS+LUo8PsMYrb3hONU+dP8fPsvLAD7574y9PUGyvub03D10uG4+kO1EPiG2Mz7K4Ho+YqZCPNJ0xr3PP4s9X/+mPcvGPr4h0rk8uGU2vh9d3ryBxpi976W5PXgfXb31CDs+8I+DPk1XqL3v5RS+Yd+Cvqx0cT7uSzq+apYlPlSIqT3e32S+01NtPPzKNL7sbw0+d5k6voQkpb7JulU+L1RMvoZu4j66Lnm+JoMHPgelUT7ZvZq9MZ9rO/qLk76YpZg9SrtTPgPyMb4WkRm+geHzvcSSSrzVmf8+N7VKPlNFIz4vWsQ86CQxvp57Qj4O+ci8uns/PleAmb6zvRA+GlJlPumoGD34Jq4+4raOvcAWhz2saFS+uN1HvYt0VT5+BHU+oLgDPkKW4L0uzw++fowJvlU/Zr72TbK+qi9cvpWJmTze8KA9CF4ePpq8Cz6c4cy7Q0uRvqoJbT2jPla+fI7PPcclQ71KZZy9askMvih+Kz4xRXW+T9+2PpIfrb4qvN6+o481vp3/izwz/xs+S3CVPpR5iD4uIuG+6XeGvso4aL77sYA+7l4IvlrGPTxevW6+1+xDPowEc74Gt3M9kAx3veUdEjySOA29XENpvSF5ez4XkW492HATv/iG570tbsu8MqIzPS5Olj1QEzK+Kg9jPfsfTDzjB4G+Xy2wPaSSor2kRSY+MzFJvlQk3TxodfA9/1gLvufQULzLnt89f2xvOdhnG73vZua9JngFvOvigr2BPx6+75C8PkuKpr4RjMY9jKCtPPJiCz1rSoY91B/VPb9L9j1iV049hrE7PkJ7Qz0hK7++3eTNvMKFlj6MYaQ+QTUbvqng+T4/q2Y+iwFBPoN0FT7CBD6+KABvPshp+T5mTcg9Y5advVzskj1xhQA+2Nwcuzm6xz2jhVc+8caIvpQ1zj0fiQg9nrZcPmfcjT6Wi7M941aVPrnfZL0QTSU+/d6qOm25J76BF+a+57qQvorfjz1Owki94OcGvsYbYb7xqWA8Q828PnCoo76WJBc/mw8AP2criz1BJeY+5LeqvnZZdD1bbLq96/FUvgXrWr6p1DY+D9N1Pry8vL6+RT8+Nk4VvfJ0iT5y4dY+nZcCviQyEj6u05w+HBVxPoiolr60VdG9yX6zvgG8vD7aRQg95WdXPpWmlT7RM7K+iqZjvgSGlroeKAU+dYsyPsI29DuGU/0+qorMPiSn5j27PCC/9C4hvkODFr3/5+w+cCbHPW0HCr7d+Ko+zrgAPg9Pi70QOh6+WPABvR9tYDy5U6+8FjaZvWCvh77oFIg+IEUZPm1npz3k2Z8+8ZT6vpsSpr5wVno8YIUgvlMq4D0ADR2/QX7hvInhMz4D4uO9qV2fPW3zv74Y7Ug8wK8APaI++rxOGCK9EzAHPowdGD6RP8+9gsXIPQSfJr60JCU+rhhrv6C5GrsckKW+saFivrLyPT6Bzho+21QTPpaWO70QNW0+s8HqvYFLnzxVuuQ9JLHSvXYYpj0vRje+OPIcPh/6mb5ma5A9/9Qtvgfikb4nuss7bh2Hvj5iqT6i734+B6+JvcRs6j0rrSC+c4+aPeA10r2Anei+CpTQvfGC/bzSbSA+K60Tvzxbg70JD609jCsHPlpchT43I4a9GPzovS5/6T1VGvO9nYnEPWb6CD/Lqum8wRHsPdZeN76GzzG+QRl6PWC8oj3D+z6+q0K0Pk8Tp74pD2A+lrvxPvmtuD0kqkg+iFxAP8dlab6MtNM+4Lv/vhWtjzz0ypc+SackPjFOPL3o9VI+uDfCvn2gobxO75Q9I/cEv/Lhkj7CDKO+0mTyvSZvCT3ovkW/wm2UvLVFWb5Cv6++XTpIvq1cnTms6gk+MAXovmEaFj7tACe+1WhiPm/LI75vBWc+8bJfvX/CYD2tBBc/w0QDvs09Zr4rdIy+dM1GPt+08j3pJGC+u7ngva8/nD0SzAm+5fH6PVyn2T1mvk0++q0fvkxGeL6iiFQ+1FqgPqCqIz63rCK+5j2ivaTl5b7cq4O+i0qsPV+USj7ncOG+pyakPs7ZGz7tMai+ECxiPsEqKr2p5L69ke0EPeZhhT3mqQM+0XaDvg3PfD6VZhi+cP5lPQe++jzmYYG+hjvAvlaUNr4VHzq97MOXPeBpAL5ujF++gCQuvoHEnb4DT8U9Dw/iPZlux72WB9s+FzxYPbrDlz3GOrk+BfPzPSqIEz1i2AO+s2NtPlFzXr4fwhy+wBwovTaEt7xQkfc9DhtjvlTte75wIzS+JO4xPRYGhLzpAws9t9hrveBABT7C+Qe+JxsrvjaqLL0T7wQ9KEYcvns1XL6bS1W9Q6k9Pi4xK76qd+o9AOa4Ptua3b5yLlW+oP0BPr378bw7v2u+td5vPkdEU750Nou+hUw1vo2Nj70xlkU9uigUvu+3Xb1AnVg9MIaEvjuxGr7JbHA+8f0Hvty/gr4WPme+SwOovjsmHr7velW+yMaKvmE7Az5266a9Bno0viHwcL6jNZy+w2scPWzHoj7QfrE9mocaPLRoJ701awM+56SkPXd1e77oXNm8VUxvPkqzJD5r0Co+09DmPXF64T3ujxQ+jQU1vr4dLb4ms6O+5WWavjIcib5bWgm+MdYwPrxBvrxhk6W8bc1pvHAYEj4k5m6+oizAvdV2mb6uHAC+OpeMvSFD/D3e6R8+WKA5vXeaGr5MAvg9BpGcui0QEL09zWC9IsiJPlYTxr0fhxi9SbrSvYkNdj39BZQ+zM6wvh7V3b1IlNE9rFqkvdGffT6kTKq96icYvX8ceD4eBS09S1nDvb0SwD6B9LA9qnx6Pq8vd77tTMg9wQsyPL3FI748+Am+rEOBu26VNL4SnEo+dlJevhKRmz2HqzW+0IHBPU77uL62ieO90zpnvSM2bL51Dzy+gqaGPAQ3Cz0LOWg+z4CIPvs7oj6VAd085LK8vka82LxLgMM9xdM1Ps/jHT6ElqE9+asjPXV2AL6Ly4A+/cACP+Lq1T4hO949qTN2PSjXSb5uJq295jVJvVP5oz1tmYU+0ybNPqcgTD7ZacM+pNq4vZu4yT04frc+YOp2Po96DL6G6dQ9OhYkPaBnbL6Awka99kiqvbf8970vqlU8C/7RPaS6Dz2blgA/uoOUvmFn7b7LJQY+UwpvvnVmDT3l9p4+cFzfPOUyoL6dXaY7N32XPmuSdT7ZeBW+721BvqdiVD5fOr0+CFBbPnGpkD6HdMI9TCdqPtVJsD0a05S+oB1LviKdTr0l7RS+NlSTPrXZhL60w+Y9lMelvgRhaT2s328+J2QwvmalbD1mvJu8lMiPvcMdtz1lh8y9YQxevuEMCL6gPQk9zM1Jvi839701tig+2K8FvqiJf72tI6C+XfVfvnbg0b7P6iU9hTE8Pp2OFD1aeba9whXyvc/YBL6NyYc+WEnNPp/DKz4B8xa+P81uPjg537vIY4w+ylD1vfXAz76/nYm9MqAHvZEwg76dP7s+7MEkv1rpl776Q/a9tSmFPSfRVbxV9g09GfHHPpE+sb257YY+fOubPA/vH76FYuW+iLOvvlYaxz3bh5C++qCevlIepz6J3IW+X6NnvlsjVz6kTD2+Q9khvmbrH79LbaO+AIBGPucyST5kkHq+GThLvlNFAr7Yg2c/kkaEvgWZyr762oC9AHL7vnr+sr1khD2/N7MFvomZPT6jfZ+9yLxPPfhFBD4Y0SU+CXiPvlPQaL6WuB++b4lhPWcOLT7MtKu+20CFvn/9Xz7YjbU+Ewwzv2w+MT7I2Hw+gSo0PUjc+741Q/G96NNyP/gQDz6FQYS+EoRxPhwbHL58M6Q+OzMTPh14WjxsQJC+57IFvc8dlD7L9gg+BO+0PsMfar3UHdU+AEw+Po4wQj6zFMg+jW0MPhXjYD5LCwk+XT8kPod5x71tGMW914rzPQ1h/b6Vy2y+PEspvqNLibzAYh++f7pwvBtDw75F/CW97aSbvrn0vb35rBk/WGmzvFhOOb52P/E94x7BvsEU4b7HG7w+USsQP9hlgLzxu4I7tXj2Pam3nr45BVu+dToQPpAbFr5Sj9296qcBP2F6Fb6cAnG9YvX3PdizDr5iMWU+/Ckavb6ZP765xxA+aNVxvvj22z6QxaO+xEc9Pq9phb7VJHC8Y069vS+CyT5C7Jq+ltzRvQKMJj5Hog+9I1SuPLMPTT5Y8q69Cr3Cvp2xIb7ZgZI+hAXBvcK+gD5+TfS9+aWwvkggsj7APLa9Ot2Tvj3i+72kT2G+CQaVvfVeU71ya6s++Q5JPnR5hz3FYtI+fZiCvn0WQT5FeZw9BwjXPe3CljwOnYE94/hdPnKqBL/9Ap0+iw63Pe3+4L4YqD2+reWjPvQLLT0IOgG+ECLBO3w5FD6fUcS+64nyPal02r065U6+DfbMvrqcUL4mWS4+g/rqveFg+z0tksw+BG9IPEBrqz7grdq+TYLwvKStjT0T6HG+gTbmPvA/nz3wKJg+SCUBvU53Qz6eBxq+oruCvifzRz7l1lu+eBiTvFVePj70rpM9S1RVPmKcj77t3rm9yAE7PnVDk74fdVU+XV2BPhYtl72ThXM+C1uKvmNCxT6Ep1w+0IHLPm3Ksz3Yt90+R3GJviHxYj0lvw0+0Qt2PX9Zcz7+kOk9ULaTvrRMTz1EcHM+He6ZPspsvT5eDja81pcmPgdMtT7s+Jw9KNT7vI7pkz4PKv69TXYMPkV+kb5jj/W9hEGQPuv3kj3c9GW9Ii1YvsyMJ76IKlK+IA81vgqy971qXP69zyA5PHSEvjuwg388TbWQPlaatL0KCw+/qoA+vtM5JD4Q04A+D7Z5voxUZj3NnJA+WfnfvdthED35aYU9XUjUvRS1vj2uM3Y+wqmlvutQpr4CVyW+53cSPJ3HBD1t0zW9Hu+RPgvbO740W+u9WPz5PVjPgL3YsZo+kpmKvnYXMz6KmVK+BnNNPWQNCT7TJik+uTlFvn7pjb5Rz8y+1cdkvetkFL8wEQy+6RvjPRL6yb5+8Fy+j/PDvhyhpr3HGMg9jk7uvSZZ1T3/hAs+Ta1ivv2Vmb7juR29kf8Dv5qlUz3xnRQ+ybfMviAuk74uenE9tEstvsw86TzUnHW+vvwavh3aKb7mCfG+eaMBvoEdLD3/Fxc+Ibu1vmwhAr67CMi+Bf/CvR+qBr5Xv8C9po/7PbNFiT70AFi9y3Cfvp/9tD08Ds890TMvPvuSKj1OurG+IiVevrrlMz7F3QY+cUCDvqt5Mr4zUMY+hVBDPs4bAb4AHX6+7VlkPuzwMb2G3Sq9ZQynPmxplr0pZAy+IIl6PhAywjzBSqk9V9Rnvl2OmT6k7zC/krjHPtGrNL1sl789+2jCPbk+VD5a1UU+u896Pu9m0T1I31a9vNMJPiHzBL/lBea+jg9yvnOhB79zED89bPeGPWDuPj7phVm8nFwLPna97D64T7k+Z1YevoIIuL0xXoC82uaKPcB53L0M74i+z1SzPVgW077UEt69Zs7tPeaPwb0xFV+9SnfNvLKEGL5o2hi+wAwPPZ8cjjweBQO+IwkYPuyoHz277CA9P3j8vb7vAz3OYmA8MG+AvmcF6r33/To9m0VuvXTLKL4x4yS7BnVivfSY6L3/HXy+yvgwvX+qqj0kx4u+1dCfPClupj2zWx++Q5VoPcq7Jr6u7UO+GNMOvl8U2b0zvCi+eq35uyWMD72yBjO9veEQvn/TYb1amsq9YIiYPUyXN71XUo68DdX5vWCWDb/VgT0+Q/MzvluZAD3Rtrk9ZvPNvVzzCD5I1ha+oYsjPciIsDxZvRa+Aaq3vJqmtT3j3BI8PDZgvrdiFL6Qs407yejDvuB9LL258hO9Qtl7OyJvUz4m8DM+raMJPuWMgz0gFaq9oje1Pbkap73VNem9hzm4PayVsTz9UZ++nHJdvMjyAL48ZIe9N4anPGUOAD6Bik697RpGvTeOFL4GYRY7MGHcO1l4oL7lsuU89XTfvaPf3b2gqOE76D43vg3N+r0nOPG8CGt6vZ0KOD2u6yI8VFGnvT1HDT5H7QO+lWB7Pbm4N76vARG+Kj/jveOrl7ze9/g9/nV9vSfUtr3CEnq87K8nvtpHsL28hZe9fvEAPlKDRT3LrZi9/U/4PUTJ/r0Tl4E9as1Kvt/Qjr0BING96I5BvYgSfD3sGJU7TeNJvT+AIz5zP9M8v3DvPdEbkz1zQoG+564pvOyaOL3Rae88sNiyPSqHE73+sqW9m+usvFjnsz3bCzu9UgoSvSy1WD16avU9CkGRu4HAiL44ClA8kvjevd4chb6+VKm9NG0/vjl3H771JwU+kooGvsbB/LyjqCi+sQb8vfRYIb3Oz1692k+tPcSREz4Dpve9pkVAu3JXdD7s4rc8gQsvPnvewb1E+3g8bre7vU3Aer0BV1k72T4gvgqbZbvCFys9KeWgPGxsXbuTx0S+1xcOPCwhVL52nOe8o0u6vVUOTT53DAg9UHrKvY4RA76hMpY9dK4fPmQAprp+KwO+82IlPo86Az39dse9MsARvWc4fzwW8qc8MnPjvJZGdj1v2448ZRkLvqXg4jzwlTa+ugYtvqsfDL4k/jk9jsKXPbWL/Tp0x+68fSSKPeu2FL0m4MQ84f2svsqdTD2uAC88oKDhPTYc+j1iJPy9SXU+vcdKiD3J0Qa8g5UKvg08ML6CG2w+B8DRO9hd5zyatje+oegKvZARA77bDhE94KkRPrgvUD73Rrk9//uXPt2Z7r0edCe+icWuPTRri75yccG9EndmvqMNij24ibe9455pvIf/yb1zSAm+XcfbvJClvr1zJQC+Xvz0veevWL6teo2+GBqOvmgejb3Zhyy+sE0RPuYVbz3GtVy+yNP3Pqf3sL3Wxje+vtYsPobZ8T0Khlg+g5ryPYnEp72Uqa6+ZrLSvfAahDwE/oe+sc0ivpSg1z6RQ3m+NNssvjfcVb4AS0u+wEiKvlg0Ij7un70+AXghPt9HJLxjvrW8yvatviiL1b0luvI8fZGmvqTumr28vCO+k6PZvsIkGL6rLyi+EiGTPmyUQj7mAha+rP15Pqbk+z04rXE4WyxjPj+fCb5bWDI+CI8kPrqsmr7NXt+9L7NTvLWOCr59Ztm8Cm8PvtAogz6Hcnq901mMPtMX371N7zG+sJSJvt5d0L0+LBk+DC5iPtwTIj2C94M9jc4YPrq3fT40zZQ8vP9svkF7mr6PzGQ+D606PSIqNr67CjC9HhnvPaSxvb1M24C97Z+ePhF0LL0t7gQ+osnSPZx3Pb0gbEO8aNGWvhNikL3KYxM+kHQPPXVcKb5LWoi+GDdZvvFh8z1IcAs+o3lzvTKdeT2xJMo+4jwrvkipQLwpL2++XnsVPrVBPz6nj4Q+UW2Uvi8wLz6UgoW+PePtvVcXKz7tcJk9/zUAvMpkEj7Au2e+T/IbPtDTND73C/G8QgSuPdAgjrzqB9Q+KyeivbEJHr2olpo9GbYhPX6x8L2A1fs9RZNrvQbwBb6tG26+4mgDPqn3HL508+O9QcNrPeo6eL4pdVw+4sK9vVx6AL4M3zI+KdMyPvdBuT33ijq+/yHOPcbBZj26Sig9Toouvh79TD13v+U9vKLMvaU64L1Eqtm8SkDUvH3INj080Me96ENevc17Pr05txs+CDebPbgKQr6+5Qu94MQxvpTOITzrqEy9SShBvNeyRL50zWo9t9k5vVhA8j20rDq+JGwWvg/dYr0ak9a93hzKPNTYYz3/0Vm9k4Ycvb6qzj0I/yq9YeRIvuWawD09rg6+POwiPunWJD0Zuxo9E1/HvR7eVDwSCCu9uqKovBurrruWL189pUZAveg83r38fra9GTjIO+ej2j149Ow9OCF9vY1bCD7GFa29hc/UvEYzSTsStoc8lmL3PM/aGT3Eb3A+oArmvQRzDD2/ecc9oychvpk7oL1JvJW92BECvd3dEj1oZms9KucBvmByKb7b0VE8GrNWPbGIR74mx4i+myzVvZySAb18MaA9oAYvPZzgUL5gzIg95UshPs87bT3lA1M9UKFDPUW0qj19yQi+6FqJve0vDL09ojM+NYGhPIwC4LxNCJS6b6gPPv6u/L2JGwu+is8JPrVKB7ttwge+2O+CPTgxoL11tlY99YSRPL/+Ej4JMCk9Al0TPZpWPb2L4Du9D7OkPQkLGr5hf809QWH6PTfhTTu5KUE+U1fYvHRShj38pGy9FlLEPVLmE72fB6m9xtZ1vcIp3D3iVUO7vJsMvjMJAL4ik588r/HnPa65ij1S5SU9G55cPs3l3bxmgRI+HiwmvlB5F713ITS8lRYVvqwd5j2O614984DRvX/VKT5owEE+j123vY4tGL4z6pY8ivLWvX7DA70wJP+9zEWOvn91mr1M9uW8MTBbPhpqo70vJxe+ySkIvlBc3L3ixeW9C2JwPUyETb53sfO9BzGdvntpDT5SpyO+HxZFvrE+Az1G+rO9nc0wPkGjyT1SrUy9alwcPs7vIr7tIeq9qD0nPoD3uzx8oQo8s4slPokF+71euJ095T9SPnpXx72Xebk9B2VAvrHjsjxQnuO9XrKJvJvojL6Ea8C82pmsPS5kYr1rAgO+4XPquXM5Fb0O25K8Dxe4PJKvi71mh268glCMPoDxib1enWm8M06tPSfvEL7+ijc8gW5hvivxVj3DPoM9MzdBPkYyR74gDAw+brHpPacGKz6AvQW7DFI3Pa86Wz2uMrG9ymjcPbaahT25idI+/sG7vUUKqbvumw+9qJmuPUcYzD3dk849s8cEvPyaXb5P9Si+jAG2PfDi1b3uF7u9N1yJvGFZhrxLS808desQvm8jfj1qfOo7oUH2PfsLsj3pLJI+32L2O2V8Ar4tMVO7XvGMPq4wrb1Wc08+u3oWPkQQQT5Htz89/QvvvRrUCL2yiwM+u+S7vH02fr1lq4a+IuRVPkUeIT7+q0U+FbFXPtrlij4W9yK+t1gbvSf0gT6SSmq+xNAzPXph3L06t+Q8pSu6vmOJ8Dup8+W9c8fqPdPViD5CcAq+xYrPvPRlrb1R99K9HBkXPuZxn740hRo+YVYePQ1IML6Uh1E+9yQAvX9gbjyCwyg+Aa0TPX2iNj6RIXw+yHf5u+9SVT4Rq8w+LKsJPn40HD7hxWw8YrQEvPXwqr6kLF8+NatcPgmXEj0tKFa+jMjiPfRK6D3aPmi9DeljPYGGcj5O73O9E17IPoJX8TwnhX0+HcugvlBMV70JWko9Y8+aPpJLgD3zfDe+lSWOPvzPYj7oK6g9p56vvXJmWL5IZn09jphtPS8j5L2mL5c9jddkPfaZsr487kk+wu81PsPgP75PQ+M7coH1PeWIAT6vmkA+H/Cxva9ewz7P/4m9fZnDPbt7JTzO6Jc+J8GCPX1ZrD4i+Se+m2edPB33sD5nq+u9x6VCvl2wTT7LsCM+jAtTPv9ToL1QU7g+kQiXvppavDx4Di++inRUvadO9D3dFQU+TQHcvYnPC708Nh0+q2pNvWwxmTzr/VW9cEFivFYS4j32O4Q8rAftPGC+zzwnUne9Khvkuv2ok75pw9S+3BcyvsfPkL0B14s9+I6KPhXHiT3dIsI7t9V6PqBnwDsMMUo+L/oVPvgkprwfRUm+hmY3PpC6rDxsjTe+DnAgPkdm7zy9wo+8iUHCPStxDL74Uuy8/AcFvA+8zD1yhUW9CEoVPiBk+D1UvEU824oRvfevfz0DSIu9/x1uPbFyJD1oReq96r43vlGQMj73RKo94XD5vfiZCj5s92Q9HZ0EPnOdZr3WENY9+duWvr7u1b3OPNY93QkxvfHKWb5tm4u+Qf/oOyDgLT5XtPu99yKpvXq4jb0x1c89sIvivZe+iL2u2DO+CX84vSe4mr0RddG99qpOPHj+CT6uE0o+N/QAvf+lCj7QqF4+WOi2vcZ8MT4FRwG+77bdvKwegr6A8j+9UyB2vce3jj128h4+Ru5ePKPcqTy+VC+98hwjPjUkuT0OwQI+7ES3OqTRLz39aYA9e9gzPS/CJz6Lv4g9rCwMvkpYGb5EEW6+YgA7vLAKib3lyN+9dRlcPZpGbj6wxy495AByPpejmr1xfyo+gOQ8vSxtfr03e4e+utMGO5JyYT7NRyM+X/8Avr2DQzx0Swi+uqVtPvbOHj3LAtS9pWoLPV39aD3az5c9AMPrPJuPzT1OKa+9ClO0vVe56r0Fv4q9Xz9IO7FLnD3ms9S9ZSkKvmwJXbu6DmS9Fh+tu/w8Dj7y4+G8LdUuPmSZuz180T0+rxxyPeF01j2Y0xi+z9iXvVxL4b1Obv+9c/fqvY7mD70v04a+suhJvvuOFD58khs9R+egPvAnR73gfY6+ekQOPuEm9b1ng9e8Nw09vO95YD0Chv+9XFZjvl0TQr3x1fU9z8RHPpr4Rrw2SGk9p1lSPjzxyT4dDj89rjV0vQFnIT5Jj5y9WU0jvkDKr7zHKwu+Ney5vYJANb0qU3++ha4RO6sXT76aWfm99tw2PUhsQz0IEe69xrsHvhnx9TvAlww+FUuZvfBMEb4CFxQ99vd0PYqW/bykdDe9HxxcPv/kDT7TUTQ+P4rvPeRXXL6q9Se+N3hnPYodtr0M45C+W5EzvRU6cT6ADJa9TuOcPfZ4TD38pC++EDWVPYNeJb22H7o6iq54vfxnXrxGm4Q+5yjCPF4N+T214yM9L93Yvcx59j030RY+TjMIPvWSSbwOyCI+cb0/vboKHz0OKIu9rMtkvS8KST3QLj08vRq3PCmVCr68Hsi9DxcHPmUdJj4fAl29koCrPRlE4L0A8fm9JJDoPZG7cj1veda9nys5vQ1Bbb44mxc9MvNKPkhfwj3Up3s8DVaJvjy1W74LVwg940pevv0XnD3CWB29xMWAvEKQQD3fKgU9/z1Tvk7dEr42fkC+ilTyPNSOLT06FKu8qeI6PmhmY70pnOA+jClhvkakAr7LNlo+uk6PPVNI0D22RM8+CvVPPl2qED0IFFe+ct8mPqm0bb7Ytpy+8MIwviJ2wzyMmCE9ZrVyvkUkhb5BNo89/JM9vdnxej29XAg+rTRCPSQiBD4TH2i+FnNkvHvqDDywGaO84tXTPZsZmz0T1gC+voCzO0yfhj2qT4i9X0xCPggGtr01wIy+8/aEPUYI0z7B8c887DS/PU/X8D04QIg9dTlrvnp0sT6Dbau+lqV8vtVdBT5rNn6+MfEHvjWSBT4RG2q9jhhjvhtcrr6jOpW9a23uPmPWYr4Ch8w982RKPhjCEL7D5lu+dkj3PYNhOz0LD5i9SONPO3f2R74JjHA8K61mPsKCZL7ML4a+yt1vPmhRsb2UtMQ+kdXivclgWD4tOHY6tnQMvkyuP73iyFi8MqMavnWpjz76gYG9voFEvrwUwz4OGN0+YwxtPtTIzr1DBzA+zle1vfYRoz1aJ647IfOKPUbFiz41PdE9HxN5vru8PTztLQs+JQNQvs+9kb4mukY+CzKVvdrB7r0qW5O+M2YAvRQZ5b0evIQ9Jy72vY17j72r1Vc+c5AXPt1LE7xTAam+K895vrEPUb6xjT6+wQM8PIBMiD5WkiU+b1jRPVCa4j6/LF29GhR9vtMHwr5bB3E78oXXvZvreb4oi029JE58vmj5HD1zmBU9nQpEvjHCxj29PSM9RSoCvbaKCz7fNdg9Hn4MPgDtUzxgcqW9JgbrOyhBKz3JyFC+yk4tvpz0RTxQM7g9vNjxvGyXor1xLsU9IMNTvrDSFr6/C7i83Wj2PTwlzr3vcrQ9TWUSPoDrZj1f8xq+PNRiPh7hxz1sqou957gau1VbFT6gimU9PVM1Pp58z73N8yS+ytlLPpX7ST1XZIW9AY+LvfZt+D3MPUa+rDOJvev3Rb1PFDG9t8uFPRrAmr0Tolo9kpKyvcWt6D2vRgG9GnY9vRGs3b16DTU9ra4IvtA3OjxqgAG+1uSQvvI7HT1HMr+91QAiPaZ5B7686LW9Xu/Dver3xDyN9Ku9sEi0vfLU7b02Rrq9rPOIvaJnbr1gVru9/lG5vZOx/L2uEVK92W1rvLaxSj3ODsE90RfxveOJU76DkSi95c4uvowbR72sAw28vIyKPdVjAz4uulO+KJkSvXuooz0JtY881UA7vWMJar38eXo9I4tguwLai7yo4wW+rjOjPTPmPT5Z4Yw9Yx3nO9Ar3ry9bJe9CG90PZF8d71iqOU8yXBbPbOwMT0V/6a9MZmOPTBPaTh9qSk+VAEbvkex8rxbIQy9zMLivYQvZT1CU0u+c+rvvTjgsbxLip09rucOvQQvnj1qj3i+QHj2u82cGL1UKz4+t+RzPhBIrLyGqoc9FTplvaE46b0x0hM+hCkIvtvnfz2EDc090T4RPWFGF71b0hA9zR9nPX7eJD4fASE+I9wOPhzlNr6ni3m8iKkfPhX/9D2aQQc+ihF/vS+PUT0VoDm+XMC4PSriM77UhRs+ykivPTvL3L161Bk+bwY0vhveGD5RDUs9VF2gPSXeOj5+p1M+fcVSvkfchL0V6gK9m6UsPsvEBT61Az++nVwmPi0Fkr5sxIC+0ZsFvZ/X+L1BhW88V+6qPASsob1cQOG9nWKFPn+HBT7RVJi8ZJUcvL59Lz5Vpgw9W/huPeVW7T20dSs+ynw3vrVBmz7+AwQ+lJquvX6wHL5QyhG+n7ICPg2tHj68O0u9xEbxPVD6Lj4eTzu+X838Pd4OnL1uvg+8lSEOPocEJr5gDGu6rKg0PfFUkzw51lS9pgNCPlFUkL62OLC8esN8PuzgYrx328C9udYkPlfOZbybjyg920uWvjzptr0IxjI+/YUOPNbhYz19TiA+osxBvG8dID4Awci90UK6vBzirbvZyYc92WaEPrSUxzwcePQ9LfPEPXZOBL1vm3M+wE5zPio/Kz5qdpi8o924PGVc1766OHM9skflPLmdhr25JwE8yIymO8a6vLz/vBc+2pSdvQrCT72qiRy9PpAiveqXf71P4ma+jlNOvmYwVr6Vnm4+lbmBvko6CD4L7Y290o0dvgHRuj0cXB4+4zDQPiG/dz0qbGm+dOmcPqE+fL6eH06+bCYpPsUK4b1jOU8+irEHvr0ogz4TluQ9mNEKPYR3vj1SYy6+gSLrvMzYBL0ruz6+xe9APEnnCrxx0H+91IUMPvnTLD6PQJO+G8CTPlc2hb5vYCG9UL2EvYVHbb6YG5I9+tCevtU6jj5KRIE8c7EwvZOsfz3feVQ+kCRxvmgGdT5aRXk845NLvTu1Vr4MZx084ZIbvoOKpL3AKiE+8bMjPc9Ctr7gvLm+Eq6RPhPNI77plQy+DpdvPWIP2D27Kx6+KYuCPtMtcL6CSaK97T2XPmxZnL4QenE+TrPPPuIonj0JRCO+b12kPqQPnr3H4Eo+NBHEvcoOLb5D6W095BzTvi08BL4ld8Q9+NMnPUz9F77nizU+kyR3voN2Mz4x6tA+cpSBPkr1fr5nrtg9cXeUPlsORT6lbJG9g8OCvq8CPz72RSu+iVwhvUtEUD4DopY94IeFvSR6Nz0oVFE+8vG9veEjOb7X3Zc9EXM/PmTXRL5ACZY+SCqqvqLZlD5aMYu+XxwBvjDKBj4PkIe9nIuJvh2GML7kGYw+rr8bvpQtST4mjaY+cxEzvF/k6j1NWWG9+LkUvsJhCb7rQAQ+zDKAvnnJbb6CRtw9bqicvU9LHL05Iys8X5KKvVBimj2bSiG+T3PxvYbIoT3rH1U+3x/TvTRRYD510Ao+mFoJvpRBjr1iSbO8lJDnPfZQlz1X9VU+FG/2PYv4Nr0UHqk7ocLAvbd8rT1JjfC9b44JvtkC2D1FN849zETRvStwCr69YlQ9VOp8u85seT52LPe9+uouPQe6Jj4NRpA9U8JhPWE+BD5JvJo9K0N8Pli5Ub5QO7Y96QqjvVoKIb5jaxw88RmFuznByT1hXjo9jToCPcBv4j3ORsw90onWvW9jzT1dW7w8F0RFPJYMpD2Ec/u8ui+lvJgeFb5zufA9GjhAPkzNMr4R9py7Elu9Pbs2vD1E90c89hp+PRVKhr0IPzg8ImEVvlRh2j1ftYK9R6eRPm+UBb6b3sS9zYI6vIdHij3UKNM9S9XtPY0T/Ty2yzg+1yu3PUafKj5p9/q9dmLKvbeC6T1ant09swbNvY1PEj5qpKy8xBvfPTHvF72AxAm+VeOLPUFZQD6LsqS9HofnPYmPAz6prAc9ZuaGvVFq2T26bB0++rUVPqbuQ7y+lcm98IIlPZUPt70Kgxw+lMjaPE/pxb0VdM6902QXPnvO/732px8+8qpMPfNIPzy2bMq8BT/wvQ4XHD6LzYY9Gwi+PX7Iij02Vo+7bi2ZO8hdrLwn3oo9D1eIvd4IU72GGbC9IDCYvCtViT17Mvg9IP+mPcHcZ72Bi0w9sNNRvuKWCz4QyiI+cd6VvcpZsD3JVwe+AExHvpZpwz3Qg2q9lEyVvRDUST6Ezqk9PvsHvhQsqD15XSg+XE4HPgMDE7w1pb+9DZaNvXBkLD7fomI9qvNKPqhbLT2d5Ha9XLroPZPTkb0cbgm+RrzQvMINoL1Xwu+7gQpmvYdORDz0TuW8qjvXPeLBJ743llO+SOMAvauk07orDlw+8aQsPZYs6z18xHo9jROTO9mgBD4qUfY8atLrvT9uID6ZNMk9NmWRvY4uSr4/rk69/p6fvDRfJL121tg9rfrvPaKPYb6+/io+KUpYPoHAQD6c+ky+aU/8vUuQnb1lqi4+APcCPsRA1r0+i489hSMsPhYHLL2O2mC9qpZLPR6oGD7n+Bw87JvzvIOPLj5E8N88ojKyO/tixj0ufSu+4u0UPXX1zL1UELw974RqPW6O170dwwY+tXcJPtDlJj5AIUY+HT1EPi9YgT31PCM+p35jPh65FL75FES+G3VBPtvZEb49wI69BTA7PhP/Yj3pUIO9ACDsPVxUYj2JHDk+Z2uyvdzUgL1D4g8+UagrvfNsAz7hzrg9aEE9vdvbir1pQm68Hw1cvWR8rz1Dwu892fRFPSsKJz0HgnG8onv5vdrsOz7ovJW9NRbOvcVXZz745CS+1rCKPgKR6z68Vyy+7VMrvPp5Qj2qJLe9HOioOwjrcT43FRe+zbnDvGd32T0v20E7QwM9PqM4ED4LqEg+n86rvXUK2r0bgWK9xeiKvpuR7r3H3FQ+ixL4PPgsRL4XNp0+LDydvtWdlj1mZYi9S8siPr6GGT4eJH8+JrOJu7iYyb3Y7Ro+mofWPTX4Mb1OxSQ+nxq+vk2wKD3Cnqo9RQqTvUSH9z3MfqI+5O1TPDuwqT7BMBQ+pzUKPZyih75pSMe9wIFEPtyBFj2gMi4+reaMu8xlnL2SPRG+WHFsvT/KJb4s4wC7rK6OuudAaz6o/Hk+j2gmPuCjTD6sya68NIZVPW1jeb7BSIo+sjBdPZVFTTzzh4m9n1RqvXQ9kD5q+Ey+VAV1vrG8NL423yG9fyvTPiyB6L2rNDa+aOWuvDlN1j1Pz887/3ymvqq+ob5AVOQ8eX7qPNGZhj4oce48M9QXvivYkj4qZoK+QUayPTIpmj2YH2S9rmKmvmYdvz2R+m490KCUPgL1jb2ca1k+KoYhvvmzhDx4Jve9TFagPrI7hL7GhI8+2Glivvfli746FQO9qV7svYSslL4OStG90vA0vahMsLw0ww4+yv9Zu46kYL3QSka95IIEvj0yeryaT2++HhB7Pu1kajw2O6Q9J5NvPdhlQT6LVLe+nIobvcis7rw9cRI+xlJyvrju9bz00Mk9oOKMvTu6Jj7RSkO+E8lOvtcXob004UU9I0orvoumlb2+qUG+VufxO8d7tr5hkbc7tefCPXyOmr7Dj+q9mAICPnJFw73rAG67J5gKvrUhyD2etQE+fBR5veNVFT3WNDa9p7yvvg6Bir5xLzA+lzpFPPZsKL4R4ZS93dnivVIQCr6l+Be+xu+QvUjspr2du6O9Rv4hvuDn6jvSqcG9cpwCvtowUj2r1zg91aUvPr/pIz1H+JE9clUbPc0iRb5a4wK9Ac1vvYLFdzxnapy9ysDFu9e/nb2mBCa9y/GuPUnqL72SDQ++z/pDvTaekL37a/296xjBvUVKJr6B8hu+kMoTPigUFD2xUtO8BngQvl1fiD1QlTS+2iAuPdxKhz001EU9L/7nvfQwLL1/sw86qqoSvAlqBz74h3o91ipSvI1FnDxYGHY9kYvnPeC/Dz5HiIA9LEs2veAdsz2VHhS+voJUvtby3z3rnIC8z8o9vSX1ir1yyl6+g+5KPQpCtj01aeg7gF04vm8fGb6Vfx++jp/OvbDiFz6Ihco9E8g4vhhaKb0uQgA9fDGSva75SrwR8v29CoXovRNRIL6L+tk9qomHvc7HMb6IQgS+GcpEPtRvsT334eq9xsRjPUqVcb683Aw84piUOgRGaL6J2QK+8HXlPSGhLT5j5uo8JrKpPBRqq72MDLs9aHMrPmXkhL2dmXy+0KslvrTJTb6jbIm9Jn8HvnrPaT4wWwC+M1EMPueuh77viYE9/HT3ve13Qj20JkQ8cxWCvYOfFj4R+cy9XjgOvu3bvD1h2VO+XiQ+vUTlNr62RCq94FCuvbH6Bz7GOl89SKGnu4zzBj4N78S9rn83PmwW5bvnmOO9Wpk+vrkQ9b2DQm++LlCMvUhrWr6K4Yq+UwvKPUKJAL437TO9AII7vKzJaz0/ZOm7KhxYPRvVMb73V0A9ZbJSPUZOpz1Ks/A902M+PPXBFD6+cwg+HZ1oPVkLyL1NNZk9htWdvCEslb29VJ49v22tPbLyzz1+52U9+vfMvOFok74W7gU+OkdYvS9t7L307xQ+sj+/vbzg9bzMeDI9WwB4vTJDAr4B0a09GmlRvA7Apz3HWDg+Mkeivfx3oL1dIUm9axBuvfn0AL5OfQO+m4I4vdJO6jwo3H89fCLRPdCciL0I2P09CLLRvPC81LxIPXe+84qsPBFrzbzTqlE+iyyLvvw6vr2MMM69m8ISvn/ihz19GkK+golBPUMLMz5CUhi+if18PYT+Wb6PKha9jFLnveC2IT0r6m495q6jPTR1Q775Psm9ZJxovjoqDL6Shd095cG+uxg5Tb79OC4+zR0YPXsgSb6/PZ+92+omvoxt3b080mo+W2dGvqitb77mQIe8RbN+vUKNj77vGjG+b0DsPYU8Pz7foVo+ySmJvo9lmr46PYU+8CCwPLL14z3MpXk+WruMPnE1gr6CuI6+8LZwvat+dr6DvoO94Mr0vRLbVT6M1co9+M0ovp27Bz7OlB6+gysdPslhvL4ILdO9SotmvTsLGb4KbAm+iEsFPaelzT0ldY+7JiQtPo+jEz4BfCY+ov6VPS/Vn715VJy84AniPOVPWj7uaV0+Zm6Vu8lgQb5nRYk+pmEsvHHqmD355US+rycXPkD8Nz7pIXe9kOSXPf8dL76GzRk+49KSPUplbr73tHc+A2soPqqrZj6UOk69OlotPBaDhb3z9Xu+nxW6vJazT77nbV8+X2M3PnaRW7u6azI+Fzcuvp8noj0ZfWw+AMxhvckdvL4W5h+9N4AkPi3ff73VGoc+ugfjvaxEBr5TIFA+tc/JPTSTub0DjHA9JktNvTgArT2qp669GWEvPphrCz7Z9LA+04pFvC6zhT5V+km+9VmLPgLbyb0oHYI+ope8PbyQvz3O+V+9frr4vXBe/DvZHae+kCY9PXPliD7b+K09u9VTvt1i6z36FqK+hNUhvVv4cD6LOKM9vRf2vUNeOz5KAHw+bjwwvtl7VL7BrvY9lXmBvoiPvb7Hudq9qRCrO7AQwj19qEA+NM+RvWD+Dr1g0IC+H6iRPZEWU71c1Og7qMv1PRmhAL4CBBW+SDRIvnjMvzwEyxa9zIeNPNAWFT1XOWA9cz0Zvn1d5Tza77+9CHsJPqWs+j2iJyi+rpBovQ5OJr7N0ZG8ApgSvekuDj3y5Rm+c7cHvMLijzspTNa9z9rDPSeJAr6sFCi9U8QhvmwlgjwtUwc9ZkMQPYDrXD44yC89qyZCvi/11b3cskG+FVBovV+S+j2OXoQ9dqHRPT62Mb7YDLi96QHDPRYCP72SLxg+TqgJvkvFc76aflw8lsshvt2drD1Zngu+ggOevWoYKz5+ome9hgyEvrcGDr4zwrg9Bds0vWlOdL5oquI8n/BQPXXRQr1ILhQ+avbJPDPCyL0UdUW+z0JDuxs88Tw7Y1c9930Svb6c0b0yiSO+i6xqvrM6c76qO5S9vyiGPcYoeL26mz++wphpPQFivjwC5VC+x3wHvC+0abrb/P49YWKFvTEvZD2OKyI+U4wYvmkAOr53XzG+hPXlPHINVb4XGVQ9v7H8vWs8/Dr0gBq+khZCPVVBxb37EUU9ExUjPSGPd70Kaiy+G9Mqvv1nJT035eM68wKpvm0hx731VSW+z82UPe1FBj7FW7Q9c0gWPnDxU736zzW7pPm0PaF/Er16UFc9u+E6vgt00L2qCR2+vfSHPfcfyL2+VzI+r5hqPpsNsj30gIq7lD/SPVaDz72Y8cK93nxNvh5ZgL5Yxyk+Fu7wPOOcnz4eMpy9pefEPVx7rbx1dwA++AB6vsrDkD1k3x6+gkRIvjJDGT52Eu08DEc9viASyL2Qb4M9SeqoPeiPRr6uDiG++5hYvuAzYrw6zgw9i/iwvga4rT20RVK+KcdiPjbZH7xL2Lc93szZu1pLHL5630C9/UcfPkRwej0cbAW+b5EcPkGO+r3MEle+vKwRvj9R7Dy2Kr0988GDPPEZxj3+eSi+WrWwPbKaX71X/mi+pdUJvrtzVTtHxYG9wvuAPUYWQb715fC9B8V3vUcmVT2RTwu+Wb4vvVHzgD63aEY71592Oxm1ir7bJSw+ZaOcvE35Bz5U+yM+nePRvS2cDr1DPWc++NGLPTTyaT1Uwkk9sCAfPveRwryogcu9ss6sPTIfAD4j/Am+zmJRPdfiPL7c5No9jBj6Pc8tUr13w5s9SAdOO3yRpT1Wk0Y+xOEBvrTTXLxHjdm9Bfj5vYENEr2DpZK8JiUUvr2+gb582kM60h1NvjswDj0jo1k9jrabPetVnryu7Ly9QLM4Prflhb2d9qI9k1ENPoKypr27B209BnPnvXhBSTypc7m9+jYkvKNQzL13aH49P3IpvimqgL2X9C89BQFUPjysNT3PWtm926qfvrX+mT3H6CE+OA0aPmqyyb4y3kU+O0b2PXdfFr1Oe/u95la1PVnwD74hRcQ9g5AWPasq9b1lbww+uStEvXc3xT71KZO+8hlaPlE/x71E4L29tJJYvclCDj4nYKs9nPmuvbhLa71Hasc9AFYOvpkdqT7CQyW+j5PMvS10qL6pcZc9uBmpvrN7Tr5UX6G9xq6vvhm2Kj27+CQ+Ff8Lvll9Vz5dyhE+5NejPGxrYT64L5u+gqC9PRFKo77bxt+93JCzPR3jCb7ADBM+IvOWvA0RU77lNwe+qn+9PTpZjz3soZW9d/KGPR1XnLwbKga+MK2evDzJj7056YE+CDimPBATnz2Ltzq93dSWPoYuKj5sdoO+G0qWvW+8YL7PmkC+26YivaRrpr0A+Gu+kOVEvukujj7MCkW9GdjtvSlKyDwEbWM+FX9nvf19mryeGGa93jXJvgXRn77altU9klBfPrxKg719f6q+XhJfvq1TibuEH5e+5Q00PZKi+j19Xho+Ym+SvjGb0L0ouye+pPhOvfmDFr4bdiq+WJR7PFh3ijzsZ8A9l36ku6/YxT0g46m+6DbXvaz1jz2JU9U8zAIsvs+Oeb3bITe+D/Gxva6nKj7KdPU9KzokvoK6AD6W+HE8gL3yvTEinb7AyJG9bzwbvhkG1r3etJ09TCWfPbPCFD1QNYC9IfhAvuKGrb6xX3q+ryAzuxDnXT0QOL09rRjnvYyPjT2kAUK8CUYzPYH9/Dzk2kK9b03RPdYoqLuVQe89wQC2vViO9r2Trv07Im02PWjj1r1jNK29MCNGvu1SiT3nr5s9emh6vls1UD5WGyK+9NwzvmqmnLvGh8m9gBdDvQrsEj6EJ8s8VwsDvj8XMz4Y4+s9gYY9veAe+j31M1U9VAE6vng7Pr7IVx89YTUpvG7rrT0Cxq++QTAZvu2UAL49ZwI+M1BxPeZSJLyWw3i+JMaqPd3zKL0Ywhi+WeEDPlBquz1q6Q0+u6TwvWiaGr0JLBC+02fWO4g3kb0R3C09Qem8vShG7D1AKBU9+ciHvOnT27zPcZ29qZqPPdZZDr4+DaA96M3QvcAZFz4GSJI9c5wQPDpCDb7d1CA9gBL3PUuTKr4JGiE930f1PciXo70M1Ps9ULrnvQ9DU70lLou9tpI0vmOHnb3U2yW9rRLovLk0C74btxa+AWkRvjS58zz1Hhu+LnaePWhcDT2GsBu+rZGMPS3seL1VEhA+ZTSQPSlbMr7hrae9s/XQvUnnAr32zj8+dU8rvmgKg73UqZW9N+i8PcZBKr4qnim9ZD7DPIKitb1eRSS+JLoUvqf2Mz1s7Ae+rFnZvRMdwL0Kwx69hzfjPLCf3b2MTZm6z1kZvmnQdL3Xo4o9Icbdvb/O6z2LhZU9vHAePPL9f751Fga9sopdvls8/7yhJ6m98BVPvh1hUj7cheo89B4rvqw3zb3vUJS+2oNqva9bwb2XqDO+1ke8vSCby702Yyi+0K3Dvaspy70Bhx++oM+3PQic7r2vNzO++pgQvhFIXD0sMto9X1ioPTSJ+z1kPtA97FTjPUlNVr5Y3Ee9LUMUPoqzH74PCj89zLFyvMbjHj68KAe9maECPoTK1rz456M9DzoLvoCuT77p/Aa9gyI2PvOVAT6ddX6+VaiOvtCdnz0Uqf+5CeoQvpsop74g0Si9cdKdvWVzxjzExcm952NAPbEYbz3oJx29hBmMPvJcTz5gXrO+Fh3zO+A8Dr4n0e693jeyvSHxJb7jkue9k2qCPD1QRj68eBS+fv5ovfRFfz1yJ3e+z5kRvnua1b3zeBS+Z5EIPeqU3709fU4+bkBHPbcTvb042Js9zc4yuimxX7414IA+CE0YPlD1aj6z4H8+QetoPlgPHj3ldCQ+9XXhPegT/z2n/YI+N2/Wu11bWLxiS+M6V4FTvYk4c776/PY9m/+zO7wRgb1I7V6+qQgWPlzkDb3RPQ09L41yPMAHgD0/oZ2+gDYEvr/ZLL66YxU+17Mevv6wk72bzj69WBxPveRfHL4bKSg9yKaYPH0RlL04k2u8VAmcvPsIhz7MMIc+hdrnvKsFub4ZRpA+GWvBPcBId75dOAu+9efSO0Gyxj1W6Qs9GRg3vaMp271JXXW+8yrRPW5hDz7VddW+3ltkPs21C743piq98JWevjt4+j1Df0Q+Tn8TvlJLDT5w2X2+vRRPPSgMET08FR6+uKqdvV5uj74Bf7g9fwPHPdNBn74oUJC9qiC4vQAb7T0UM0Q+eLv1OkiSnL3FYos+xDzCPdxOHz1ac0U+yBhZvV050L38CBo+CdyWPe12Ij0SIRg9cD5Qvv2N4rw3/XO+NC+dPe/1B71nqaC+kI8kvkt+6T1v1Zw+F1UXvjhkr77j8Rg+r64NvnhEmz5o0Eo9+edgPitSRj6qebG+a9GHvbiRaz6ySiS+WG0HPhiofr35W3i7eejHPLH5iT2kZwm+scGCvZRZsr0qaTA8aNxSPI2V9r1qbg09qL8dPuSPGD2WEWk+9OU5vCg5qz7zB6S9sk1YPpw1371eKX24ODN3PnrAGz4+lTi+culVvkqelD7/SzY9VN2DPvBxBL4qPsg8//0HPqNlij7C8B4+5AEZvTLWLD5vY+S+648gPpTTPj2t4qm9bHVMPmZJnjt4nhO91Xs1PRvufzsd+nM+NlSrvR0HgT01sh8+SZeAvq3lNj0mfXk+e8aGPueaJz4IvZy9xjLIPJA8Fj7tVs28oHu0PLyi1r1GPwy+TwNbPUKoUT49RJo9GuEMPqKaWz5xQ3c+YocivSfluTw69CA+g7InPtac2L1SbpM+A8zvPcKAv70VTVg+AZAIvuHbaD6Cr1o7+vl1Pkhl1ztQMlg+qsEIvs3HwD2puzo+UWSBPnIY5bz62i2+Cyu6vZIxBr5pr8y9GYDfvSHEEjwiHh+8p75qPtL9vL2U6Rm+sshpvhxgAj7WPDg+upu5Pe0FyL3WaTO9F5+NPUD69Twlf3S+sjaRPIPiab1nLuC9VfcoPpUJ9z1gvyo+dFb0PDIrRD5khro9LGUMvTgDtrxqtOm9tgobPsq9HT7WVM49UukCPjVsgT2XPY49orBJPQzAn70PYOA9kqauPrwqKzyNFr49lkyivXukQL5OkZ29e3b6vcMogT6k0A2+fS51PTK7qb3shou9eySBveRHHb1ujhw9Hrn3PS27AL0ujOk9+HYzPnC/rThrFKK6ZDkPProGoz1WKam9d8UFPpFe5j1qdp+9BHcyPQ//RL3GLE088nIsPTMnBb4MswY+L0+9vNBNKz7XR9m7kX8evStWjz1sfoy9TTYoPkNRHD6Gwom9MRYTPm4GCz28gDu9FQxuvRqZJT6E5MM9Y7O6PM3uez1e/2o9fFv6PWr1Ez4b5Bs+zBURPmfT0D04g3M9nVxuPE9oJb2DS6k9MVdsPFbmLT6Z/FY9HFUVvutR+T0/6gu90jOhPcPnbT4aL0s+YgEdvirwIr4SCci9LeBXPauuzTzsCgg9SZggvil1/D1hfrY9j/n+PaXROT3sofk90AcaPjHcmb0q81g+YKwdPj/IFL4lKGS+NpOiPglYKj56dw6+NmIIvsYW8r3FiDC+XFbJO7cRpb5XlEO+/7ctvc74JTsoewy9Nvo4vhBbHbztFBk+VYyaPT86FTwKSGo+35r8PWBbOjpxSbw9AE6VvYf20j33Xxw9ET2lPZI7n72lcsS9nFglPY9GoT3BjJw91vGfPUYlmr5g7x8+qmSzvQigDj2cxuC8GGRjvZRjFj2+Rc07SqmBPcFnxz3IVDq+3ijVveWs8z3xeVa+oFlcPX9ap7yex6s9JUEOu6TbBr7irLa8Ne6avY281D2F1k49ZMwkvlb5a7xtv0K+G4vavEKv4Tt7IC8+7tQHPY/NmTsje509Uw86PlV4fjwvUia9S39yvQ5X2TsIoym+uA7QPXzmvz2iQDc96a61PUJOID3WFYg9PzlROgCG5Dz5/Vg+TWotO35JPL6M6CA+ScZovvO5gz2MmIi8Sz3TPVv0Kr6cm249F/YHPiscCD4493k9iCfJvfaTjzz5EQ8+GO4avpuI9j2PbKa8joXmvemMqj5pG5I+eXV5PY1NPz3u7wE9RBT3vea3Sr5d26A+sjV4vRl7JzyDuYK9yYHGvst0XL4C4ye7gsD/PbKuPz5V8Me91rCYvYQ3Kj1z4xi9VeyDvnn3OD6c+oY+t30OvrPrUT4NQtu9XClTvjBSIj07LyU8bHqEPKRJmr1r7rO94oiAPRjuMz0EXUY+ENrAPU05LL58LKI8HNTZvVTiqD3aQa4+o5szvimSsT2U0g0+OkFXvbwKWj6EHSi+yehEPonaUr4ulCq+zEH+PTEXlj23V/w9r55hvub3VL5GlRy9PrV0vVMRhb6xfE6+DhWQPNRIJr0g7Vc+p2SAPS9ac77sgpy9LYBTvYSmGr6FNok+exYCPGBEsj0ww7m95GwxvjhBdD46la6+tQn6vRyGC778HRu+JAbuPXfXmj2k8my+rSEcve0fs73K38c9fvOyPJJQdr6/h5++qE+NPiDOML5OPJw8r2R4vjOjcj4IAwm82DsWPrL9BD0n/j0+pKMAPIDK5D1OYIe+u4EYvgQH4b1pak8+5bJcPXdd271AcnA81ZqCPcGqfb4iSqI+0dQHPrERlr6IRAK+BX4tPuxTw72Rprg9gVIsPS4Lo76aImC+6Ogrvci/vr3mSKI9qXwdvlkTDb6nldS9+IM4PEu6Bj5aloi+aT6fve9jnLyLSNO9spuJPUfuMT06NtO9JRQEPsiXET6UOa48m0fSPU2RSb2gp+S9FLgHPv2Om7zQm8i96gyjvfdP2T1YH0G+262gvR9v5b3zAaA8LbJIPSj/hj3c9GK7PByYPatdLT2u4YC+ExSAPDPocL4CAVI+yvwNPv5MRz3VDCq+MHyRvU5rp73X6BG+uwNaPQoCNT1QZoE873jvPVVXEz4M14O9qDwxPh4+yz1MATi9HiQzvT1vaj3GdnK8+6YYPpwi2L2ya2M9H+WyPfCeq7zpcfk9BTpBvTziLT4+eoi8LAvIPWH9ILzANey9Fj7IvSJ2/r0CarY9xur7vUj1Ez4j9FG9qUQnvRM+Br68OB0+B917PecqibwowJg8pYirPTF7Wr7XL3i9tdHkvTGMA75FVSc+UYUUvpRl0DzNh0C9LoqkPSxZob3BMsQ8tX8zPhnIu7xSkiW9gNpfvcXiyb3TYn4+HWSqPbI7I7u2MCK+v5GQPXCJ2z1eZA07QqfyPaVsJL5t0Yc8VOn4O7auszyauV2+SHs9vk1I6b2AtIA9MkYQPW8vvL2ZtEa7X0sBPmbzNr2SEa894syjPXTBpz0wQRS+P5fuvDih1D3PsHe8gLK7PZ1JvzstR9C9z+BqPck+Jz4VdKI9ij9Cvtct8T1oF+49QCIZvtUNsj1MdKU9RlYpPE+g9r34GXy9lzmcOy76j71ZJe29GAk0PvVTrbva7tw9fj6rPV4MYL4drk2+K5oCPT56+73aJL099ZDKvEE5Tz2De5S8erPnvdqatzkv3tY9qEgVvdAesj2ofUI+MJJ8PSAANT49za09rkgnvn6LbT4SKtk9DNsoPTPvjL4mSHo9+hGvvB04ND6Vr7i9BFa1vnJFcT1Ke4i9K57BPat5Cb4ttQ09HnSSPRQ1Gr2/+5u9dF6SPDSmPT6qhEu+BYxtvi3RWz2Y9QO+n/jRvB9uwDzYk24+4I13vEcCZT4Dc6O9APblPXfRTb6840299K8zPS5DiDwLRrk9X6p8PSEP+L0MPPW98B+/PWK1tj3GKH49da98u0whWr3G+nI9hPkvvvouJr5HkXa9UYmVPT5yKj0LNMq5KTNUvZ1NGj4rESi+tCElvrJAkb3pHZc9e6z6vVBpVr09gFa8MM/CvbU5STxURjk+cLcivuNzgL597qU8nUGOPscBVDvWyyk+JKhEPosQqD3K1Jo93owJviAttz34U++92uIKu+jtqT2E8Mw+9WCOve0AqL0x4z6+btUlPlcm5D2lhfY9OV8pvdm0iL6g8ui9DkPiPMVlOr7KvZ+9k9lJPZMOJD3w7qS9bv29vRx1W75dwBA+YfU/PCLJtL3TAgs+W6T0vU+T6z2v/vo97KcFvkTZXr4r/5Q8rWk6vtI+I7wuLQ0+EyvqvUl6hL4Zewm8VjWBPXzMgL7FWCe9kcIdPiJYI7xX11M+97EWPtbY870TFjo9TMsqPXqPfz62fs++T0anPSERdr6xZi6+gpaVvrZIBz4fnJm+RHFSPhU5WzvFNKA9ZOZCvdmpbb0kk6Q9ynHGPSFFy76biDc+swi9PRCrKr3h2fy9lFB/vtkRED5Imz89SiqKvfXZlz7u9ps+x99BPM3xHT62R+Y9aMILPt0Gpj7BMwQ+asKMvivSFb5/3tM+x4MCPdY2Ur48R1699pN8PbyRQj0pbIu+bND+PLDkfD7QF9695RKAvlmbbr797CU+//Z9vdQ/8T3cUAQ+VnCIPuK0Jz1ep7++s7WtPnIFJ738pI89ifD+vWI5dbzJo6k8gg4uvdc6sD12bR0+DeiSPcpj2r4JWoE+MXREPNX7fz2uPLS8e8JJvsMhp76PxIY+MX2wPmrW5j3CBU2+hIwlvvWoJj6XR749vwmmPkKvUT5QQoA8XRIcvlJ4pz55/US+Co0UPoZJJT4YZSE92td9Po16hrx2fvy9UrUXvi8dOb1TmE29vc0UvXtF/L0ZGoQ+evFtvXuXkD1Ft4q+fY6vPJ1ECj6DFc28alWLvukWQb0iPH0+2ErbvvFMCj7FHBg+yI67vvOZE77jTDq9bs+fPWA02z1/bxK+CcIGvlDTOj6qggI8Vye8vdj1nL0thBs9odQEvt4TEz4dJR6+rWIyPaFF5720j4i+xUB4vIJejD2sg+w9m94MPa+Qzb1jgim+BG2dvTmkAD4H2Ci+UrL7PXuySz08l0A9+Ay7vaAEnDzG1Dc9gtJrvlr1Fr4Z/4G90p8ovZU2M74Xij498XSPvQ8K1r35jyy9iC5pPd5bsbvOyNC8WFjtvYrRAr6vDyS+Mi8Lvo6/xL0uSWK9HEJhvqtwr7yr//e9t9i6PVnbvj2UYGe+FUsRvXoN+j3IqIa5No/lvSHALb32ngI8DPHaPZ/cJL6ThhS+UfggPspFiL3PxAO+P04FPqbsfz3c2QG+ptkoPKX95T22uBe+TXEOvj/mdr76w6I8FoNOvTN9Hj7WpT09S6cGvbF91T0ONUM9oE0TvHTsHT7GBRU+DXEKvT2pIb5WXX+8NpmNvRoS7D2lDRi9GJS+vCQEB70DcDE9jEwwviwfCD4au8+9iR0IvtHbxj1UNrQ8xbYEPMCC3rspsSC9fjvLPaUWp71LR5k9kEkNvoKhjL20Y6s9BwQSvvvjT74FBjE+vRK5vaXrdL01rUA+puLPPI5UMjzZTei74+a+PW5QWT33V6W9k1gAPqi+I75U/TM9Yr6HvfZEgr6IpcG9xl8RvnXgqL0ltMK9hvTRveOFJL1Uxly8oGUyPeh72707+BQ+UPy/vX10Gr5U7La98Xgivpav6zx61jS+dP44voT7pz74uzE9MmJUPmx/xr1UOT+9w/HvvdM+b7y9vkK9VZ8hvrJbLDoxn7g9oxhnvjaAMjzVIPk9cT7xvVjdqTuiG9s8r9n+vWRzRb4eVb87pDaIvoaPpL1tcyk+1dWhPnNbF73TGIy99gpvvUahW70UJoE+8xmpPbWKyb2RQB++jGwOPizo0D1hR0q+oNwbvUzcqDsZkoU9yIS+vPxIjj0HR2K+0qCTPN6XdL2/pvQ9ns44vh9xpjzV4QG+coBzPbQC8DsI+eM9Hea7vW3pL77g9rG+lIKGPWfGCT3Iz/O825GIPG73BLy9Xt09h/AjvjjUIT5OCSO+4qQtPb3zqz3gd+I9ofZSPizpkD23jLY9pnMRvshIML3h3xo9vvNnvpK6Ub1C5wY+Sc8QPh8zAD3GOei9aafiPRqTxbt8l049Te1Cvhkn6zwdsQm+6kmHPcHV372DVUa+lEkhPh9hZr1xQUS9NNqrPqFIvjsWlk8+XOp/PdSNQL06hzw+ByYgvsA7pL24Tyc9S3I1vmTIVT36c9A83ZZRPtewML7QKD+98uHZPWpdzLsy5g0+VMj9vZhu8r0RgUI+aOdNPR8tzDza3bw9ZzVCPkiP8D2VXeu9UZOIvq17Rb4cYjG7MALxPODiaj1HrpG9VWNGPksEdb5PvWS+tgH7PUdxeD6JIoc8w8uTvcT5br61LsO91fUvvnqaLz7wRbe9RmAzvnmsub22EYS8OdaUvQgpqD7W1ia9EQEtveCBr75g88K9HYFDvqzHhz3hWj8+z0lhviaCmD4p+tO9PaZrvgqVgzulLxo9xlCkvdkIiD75eo2+//I4Pi0FSz7R/k4+EBeJvgTKMr7NX5O+OsO6PUravD3C2w++ge/UvjkRXz6ocyY+/GXJvSxRhr5Dddm9KLKOPuLMO70xbsa9OsKHvRDtDr5/ts2+kwiZvkYHsj37qEM9xvh8PlKrhL4562S+7JSZPSEd7b33xGi+tiS5PRKuCTwpEYE+EDKYPnRNgj7wrH24boHLO2yq3D3ze4M8kypNvgSovz5gglU9iUsuPkHoxz7KHhc+6K9wvvAtSb5JERG+JX2UPe5dfr514EW+N3vRvUo14z1eTbC93KglPhhJGD6J0AG+/8RxPr+VzL4ooB8+te2lPoRcqb3D/oK+so7XvSIjDL5C/4S+0ZMKPiMJ/L2KySK9moUTu7PgNb0MmA491+ABvp2zFr6Ltvq93zFkvXmEfz6A+DI+zU3MvYdeyb1IRF69cX2pvap7HD7MOWo9lAgGv+oDRr4YtOe8WoAFPt1T4b31DTy+7FO6vGQn3j0JUmk9Ij+jvbAB9b3Ja448aybPvfAGLD5Mkv+99T39vWsCzjzVpiy9TjDqvaz9pbz8BZk75YTpPLUW/z2mHmO8WrevPYMWBr6z/SS+y3BFvF5Bkr2fVhk9c7qFPUBak7v3NAy+2jiYPUs1ZD4ZvIo8XxUGvis9F74Hj/o72T75OpNNKD405WU9ONQ0O7IMt7zv33e9O0/8PVqDuD2xuGw9W4v9Pewm9z1nT/g9gI0CPdzSaT0A20a8sIKCvRGZvDuanPk55uAbPs4pKr08phe7uVnNPb9/iD31rh++8YYoPsMLVDyHxEY+pYjHPalrCT7sRXU9WWnoPceAnT21Ap89jeKTPXrSXz0Dzt48ZjjIvMQSNj54sgu+sGfKvQM6Fz7ooQe+i3lXvXA/qr2KUMo9Y8NIvojLFL4stS49MvigPKuVvDz+S7q9tUD6vZQA9b0VvyI+GKkYPsNTFL4yS269hO17vk/x0rxYAwc+0hdGva38Jb4kKxM7WTr+PXnK4r1fscc8yeOLvgURG76+cl69kLuwPYs31D2sRiK+0ONAvfgxY7rtt1y+i0TdvUTWuLx/R5W9mw1fPG92m70dzqi9S9EnPvqPJb6YDAy+cbsBvu4yiD3tKxA+wVYxvTZ5Cj4YRFm+PsMwvvdu4j3iAF2+Rfc3PXmOAz5tbD8+pNQ2PdV3pT0sb7e9UwNfPrTvirw8Wbi9K468vYa+nr5efAe+ZThVvd7eVj2mlY0+aeJHPajFYz5UUTs+Nn9hPqmzaz7Al789SAODvBcvRL5ACpm9sHWCvhtLGbvfvVQ+7QP4vWz6lb6/tAG+qMHYvc8DFD5hOte9Y2c9vr7Hvz0KC8O9qAvLvK5Mv70x+eK9e5lRPR4wwT00hl2+wNjuPZYGPb49WaW+9aG9PoSDYrvPyqI9dcIxPn33hbpvazy9+CwcveJssL0nt4K94ULVvZL1Rb49pMM93Tn2vDrrQz7EIMw6FMLEPbD0ibxpIgC+rsi8vQQo5bxPMzG+JP0NvdOBD70jDwg+I09UPGDaib60Xce98eGfvUFGRr6ci7e9WuGrPSEHhz3MaJi8BYeyPimoJj4BEqE9QWUFPgssmD6h04a9sT85vceHTz5APwg+0IYoPoIRlTy7ViA+hCqyvTBWgD2A84Y9zycyvZTHXb2W6i09XsUYPiW6az7b5729Tv/DvTrJ8Dz4uaI98ZGUPi3RNT5Z76g9TE1JPvMNFD6oPWM+wkKvPb3uD74kWDU+Nx9Xvgc3/zx+HTG+sP2JPdtjXr0BAjQ+EqREPle5Dj605+a9w1H1PW/JvbydbMW9kr2+vODcGT3hFAs8qJ0/vP74Eb40/AW9mihAO0ndWL4Nz1Y+JZCJvfG1DT6a/au93YsKPXAPwb4Yig89CuNzPstzer5g4Ja+JhEzPvxn0r7mSX8+0nklvffrOTwfj6Q+bDMGvlbKQD6J3WG+/cm/Pj4GQb0dEnS+McjrvtwuP77Zpmw+PAfUveprIT4PRzg+hMN9PWwxvb1OMPm9QwyGvlqox74hW22+FB2EPWbMrz18jQq+IWI/Pqs6Lz4LfbY9Is5Ivp79hT3LMZe+RUKdvam3qL4JoJG+l/jovE2Brz2M0To+WKu6vnZOC76AJIk9sNWxPZpAm71MqaO++pAxPgotcL0Ptfy91ToIvu8YAr45MkU6QBUMPgpFKL6hOEs+PgmovbEPxjzy4c2+a6HSvaE19byCHDC+sYRTvlw7XT5bwp89OoK9PN/vJrwP1My93CKFvlkkgj7OlDM9kRSqvnqzoz5KrB8+XRhxvjfAVb5LBXG+VT6ovY3iXb1v3iC+3Q4APRi32Ty4VJS+PASovrRbmLwuPdI+T8krvVGxhb6r3zM+ENN0vesAoL5FMkC+sSCKvgT2lb5bjgM8XDfZvYXUvT3KRsK++YAmvv/5Pb7dSoi+n1ehvtRJgT1W4N+9/IUMPTtZDr0thVQ+MJK7vk68CT1S6ZS+qSvnvhIBZL4cS4Y+xKYCvt7j/D0ZwTq9c61yvR5h9b0Tt6Q8fxfsvRtQKr1vJ7K9vKkWvhJ3gj1UpMw9VZPBvZwEX7xkZMi8ocVnvh0YXz1e/vm9Rco6vu2SzDxkb7S96DylPSL+B76BtSe+zxM6vq7IbL6d1Cs9kkyFOww6Q75A9s+9ZHIgvl2Dk7w9LR097zL4vRyd3T2wciC+SIIEvr6Cqj2flB8+p7NHPOirJ7tSFQ09f2m/vWUKdT05+Z+9j+OTvKhbYb0YCyy+mIvwvQvJnb0xpfs9paYHvqxo8j0/Ayk+KaiqvQ7lCL5IRys+ovC5veDoCj4vPCA9HxMZvomjzr0Ehfu99CWYPf1/Rz1Lk4y+O6QavpRnOr7NYgq+4zVnvq58Xj1/rK69PYHbvSn2brwMeRy+jWQfvgVXuTyaJbg99pHxPNyyvr32yNA9e10JPp741b6H9i49F1givsV0eL5uQLi97s8ovkYVjz2Z5yG+OCMWvSfG9L2cf2u+NDXavAYQl70qIDA+/D1UvkflD728PrO9vXfVvaB+G77fp+Y83PjZvSZeP76LmeE884sxvi/5ub3VtIc9fmcyvl9yTT3jDMM80TZEvsShZr0Emk894yR4PJYcA74AxjG9H4SAvkhr4LzlO0C8eKdLvUgRBz6gxeC8Z0oEPXb3ejuhVSq+fRT7vatQC74skla+8weGPKv3gb5eD/k9ayjivW+R8j0cape7e7ervF6kUz25Aau9OhWUvQcnJL6ZIty74hbgvaii8b1mf48+ZWC8PdlRAT3vshM+LS9nvlWjbD0t+629r3MzvutqA7735Gy9SHjIPEy7Ij7JEJW9rmF6vvCSez3HoLk9tydhvqUlmb3tPgG+KcTZvRWREr1ejw++fYAavql5Z72Eo3M4Dx1Yvb3NgL6lovq9lcg5Pg6Enb0ExFu9oTMKvmuBhb4aG9q9NteaPRvmyzwaWyi+UJYdvjv2Wr51sKM85Ey6Pfia6r2p1Iq9EviFvTEyqLxjONK92CYGPqvvdz58eBo8BD23u/UJzL1UDSS+GT3fPa+5EL5HvYe+jEGIPU5gMDwsTCe83aVavRkcib6btIQ99+qePSMo872vebg9IULPvd38vL3/uS+8J6uVvbSSWb1BQn+9uZSNvQIhYj2Sypo9QqzPvFVh1z3AgKm99cyePgqKPr5/f8e9DE5yPce85zxJGT0+ZDQAvoGuZr1w8hQ+DiwiPgUlyL1RjT++AnUHvZLdtD3E6v294Q4CPXJ1cj2IrC2+JZMVPonrMb6Zs4U7Inq7vV+YhL2nrUw9Elz7Pcy1Ej6a2r48yvaouevxyb24a/+9MwvtPVdAY76URBu+aA8kve9HXb51SZy9AomtPRufKT3nqiI+InPEPUD6YL5FAA6+F9ESvuE7Sb7MRHM+K5a2PXrnkL7D9Se8GqIBO/a0yL5Q1RS+m3JavSkGBj78l2k+R9uOvr4xejxRvTw+jManPDKDhz4+Iim+Gg85PrtGBr6o1AY9F/B7vCF6I77AXVq+2g25vib3Hz1kQb88fRgGvsZ5Hz7sfwe+alksvZT7jL7nsgU+0Dgpvupxm75XxW2+vFmKvlBDWr3SDR+9bAWoPYtnhT7xP0U9UKYhPWCbGL64Niq+c1aBPkLHQr4UaeA99h8Dvnfw/73t+as+NrTCvZ1nRb0hXfw8dZSrvCYsMT51o46+xhu+PeHQhD0G/Z4+EwbivUXXir4Dywm+oV31vVYTMz4ciIE9WZaVvSftgj7gagy+vheuvR8WOr4YWO67e3uZvaDBsD3rAIY+zdITvZcZ7j3YP7+9k+46vugGZr2QZmM8NS9JPjbI2z0zU5y9v9JZvsQXor5LRBU+F7w+PoCmP75oH1497ztoPaBFED43fM87ETsYPlKfAT3nek6+FAjUvQgkh72PWYC+DdImuxlNkTxWU/q9aEOHPefqCT6a82C967kbvh/zUL70l+W+1JzTPfi3Cry5OTu9JB8kvnqy8r1zg3e+hKCTvs/FHT6s3cE9FmqlvILSBj00/4o8J17CvmuFrjxYtf893/bjvGd5uL2N/4K9"}}}}, {"name": "sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_1/conv2d_2/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential_1/conv2d_2/Conv2D/ReadVariableOp"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "sequential_1/conv2d_2/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "OOK+vXiDdb3vuxa9DGhWvM/0LLwn/0C9lQb4u7+GL7whYG69e8KevOW7n7146ZU6eA6HvS6E1ry66og8zk81vXelrb13+KG9V6KfO8gmib3INlS9BDZ6PdBmab0Lw3W8yP4UvXPgRbsGfoO9a8DTvAzC671X9oS9IHFuPWbZvr03FLm86VRXPccmtbwe1pY80OLtu4zxEL0UyNa8n8yFve7Pn7ugx3U6xJkuPOzSh72yOx299aRfuwdj0b0ePks8mty5vD03Hr3PUR29FdGGvcL+RL3sIaU7U9GavRaVQL1GUe69h4C8vD+qyb0/B9G9K/5UvR5qc72mzbK9yB7ru/GeUL2hmYK9JCCqvC0HErw0Bpa9+JoZPaTZW7zQZwG99pyoPCJkOr25dla9DbINPN7ZWr7s+Si+QOCWvJZ5AjzvYPw797U1PGUKQTzuPkm8kRYDPXCo97xJD188ekTyvIQ1vTtAqdk8U+JkvQHuHb7C+Rs9CeuMvSn2XDx41LW7h8GHvf4pvLxFo4I7NMovPYo8n7xgz2m7jD+CuVNYPr0c6507cbTRvMxJrb0NWzc901Q9vRkDDb6TOK29XbV9veHUsbxPvVk8V8CtPBUcsL1upj++o2iKPfzIgb19ElG878IkPaPmDTw+x228e4WqvdGerDygFz+80FUuPLb04z0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_1/conv2d_2/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["sequential_1/conv2d_2/Conv2D", "sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential_1/conv2d_2/Relu", "op": "Relu", "input": ["sequential_1/conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_3/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 