{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"N": {"i": "3"}, "axis": {"i": "-1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "11"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "11"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/Repeat/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"axis": {"i": "0"}, "N": {"i": "5"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "1"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "FG/hvlvkHj4HXCu+UXYKvo1znz2WDja+zrrgPc5sOL4rVrE9GNK2vVUJCb7DjHy+3aemPrSiy745QTw+ml7WPQBsj7teRk0+RcUZvdrKaL3EU3I+a3UPPudzs72e5U6+VlVwPlFI27zZ7iu+QIcKvosj2zuoTGQ+6deGvvEVEb0y2P0+aG8jvk3RtD0NyC6+begcvGUIGj3MOQe/6AoOPtboKj6GI789shMWPpq2Yb7fIVg++TcDvmAI0L30e5W+XBB9vWScST6LNjO+/zXpu37M3z7aIxi9Ux74PLl08b3NQOW9rdhPPaw0yL1WQ/y9DIGqvQFAhT7kDRK9TLNMvQHCWb57IkI+doIzvNU3nz0CSi++I05yPbCgkD06KyI+UwoXvqJgkL372cC949wgPhcc+z0Lvcg+wN6RvTdqN71iTLM8RGp8Pp82AL69TT09DSsOPsVwA748i3M8w267PYfgtz3MUEY85HeZPXQ44zorjCq9Yj7Yu71+Mb2cmCo8e6QCvdnI9r3HGNC9MkB7Pv7m6r3foEG+vwPHvfzjPj4Pb3O++OL5PaPlkD4IHm4+SeWJPXtWDL7fMHM+s9VTvj4yjjtvaSG9sAXuvSOdub1eyfA7WDRJPopLqT1N7Ig9g56Tu9ku0j2qmsI9SaskvhB3gr6jiWI9SY7lvUOHIb6mrPK9ponPvfkLArv3bkY+M52yvVVQgTxQUd69G4eHvJ01QD273cK9yN2MPJnZv7xVax8+TmZ7vVCpUj32ea+9gLNnPCOgprx+BOQ9hEbbPZ7lXD6zNie+pe5WPQWMKD5KMJC9RuE4PRwF/z2pKt29FO8OvRc8lDxA34k999k5PpuxnT1cR169BFb6Pe8BXz6oT+O9LvlhPf2BnDyH3qA9LPe+ugvqfT0S7IY9Z7NPvpUYHj2HvQk9tZCbvSDF0D1CmIa9BasHPliPKj2739c8IrF6Pr0pDj5kfSM+hRo8PTx75LyPlrO9e3QdvuXu2j05uLK9RIXOvb/35DzOCWU+/D2cvRZj/z1lgFY9EeWMvc+h0D3OIgE+iG0bPYMYrzyxyR6+AESvvTRO9L3nG8U9IvtevrG+Jr6JDHy9jpiuPSQGGj5fvgm+BOxgPTDG37yXOKy7ts4evmqN/zzzHqu9A3ufveU5jL3s2Ko9d0QAvkEtl70exBU+jEcHPcpJGD6qFes99XoXPoTNvr3008O96Ep6Pe0+sT2fEKw9jxvoPep3lT1KHmU9FWcmvvivBb4IEeg77FClvAQCCj4kdpc9LhEqvgYpoD6KrK+8m3pRPvVi4D3O2P49XE3EPZEGFb3JwVe9yy6YvGI+BLsRlD09PUNkPhSZeD7olFU9nGHDvXb6kL0O93o9KGszvXE84TwePaQ8Cmi2vaiIMT5alW2+mRA7PujpET68eGG90Rc0vsmiKjyjkfO9FPlUvChtQb7pvYe98UkxPt2UtDzXFZI9KxKJPT0CJr5c+Yu+8xrIPBMKEz5QiVM9yJMaPkrrPr4JBIi8cpBDPt45gz0yn9O97wfvvWYxZ75Zsb698ZWXvV2SwjypNdc8FH81vob4Pj7agHk9jt4xPka8370ta/c9XaQfPWPaS75ouJS8xp0tvpLamb0Au5c9mxPUPSlKDT733qS94+AbPr9+Yr631zS+yuyYvYrPCj76eQk9wWTevRdwzT2dlxO+SDsPPoWBhbwMdxI+bXwevmjJsrxHvEo+7a+8vZ0t67x4rTS93VEUPtL9Ez4HY6u9PmoiPqHOyz1INaa9c6OtvIjlhz1xyba9I5w1PTtsBj7VZg++LJ6yPS76dT1/rss9QU4LPnQ5Fb6scCY+fkZfPbhh0r1pU+09+n51Pp8a3r3aTHC9VA14PfW7XD0iWrK93rguPjS5bLxGJj2+JJoGPr3ZRT4JwZu8m/L/vZPe4b1H8LE90BG0vYnFhj5+HLQ9c6yGPXge1ruhhPg8wAaVvcpy6T3qKUU8WigkPtKowr2mRR6+EtsEPacA+7yA/Lw8vQAWPrH96D1T/+S9nWt9PUAz/T1OVUW+Z38wPc+MYj5o/RO9SicNPiUWpL0+RWy+o74uvomdrT3u5U49fvUJvmEu37240F49XDgJPkWLWL59+rS9W5wdvo9ciL3bPhk97TSAPZFKt72ocAY/DNndPSblOj7x3IU+pywTPrLpaj1WDyS8AirqPR6Ytb2ez0i9Vj8UvtQShL6DMee+KaOavHXdQr5EF+G9JxLSvXGxPTyfNsO8Te6BPpdgRrwxcPM7x2APPulU+r1uv6K9HxImPjWioz6uJU++ht/tvUk5Hb2Yjay9nxNjvKtaqj7Kc549Du7zvRR0nT5lyGC+cde4vTQQAL6s2dm9VcQHPmAk1b1OT5M+1EZevVIoX746wB8+K0Q5vh4l8T0mqeW9378mvkawir3TESi/PhKmvkgt+zvytia+iFQWPrkNXTuNSLE+c8XHPdby8TwM7y69xEgWvQIYoL1/wai9YfWSPgdDJb59yAM+MKuIPUzcJL4mYTY8bKQ1PSK87byVpbW+D1gfvhjV8TxoSUI8zlbjvXNGfjzZcWm+oCA9PpSSbz1DDyQ+uk8QvmCiwr1HwUO+Ld4kvuwOhT6iXZw7oplIPhXTH775eBg+pT0EPnxXtj2dBwQ8SULAvWp2KD7xVrg9BfOEvc490b6VpLK8a989vWdKoL0oToe9cq0IvqsaFr4QGZA9BAnMvGbkwTvS3Bs9/7tgPE32Uz5HBTg+dleGPKY+Kr47KWs+GmQqPsQWwD0VXYs9d/dfPSCnIz1DJIQ+G1E3vFK1jr33l4a9K+w9PYOHBbxAdKc9iwdUvt/EKb5B92Y9HgqAPa518zzP4xA+QyJjvVcir71TcZW+Cxc0PgdSZz6a2pU9iL27vZB9yT1W1qa9Qx4uPuNWTz5y5jo9j9B/Pt6nnj3eVgO+aW5fvXH9nLx65kQ+E54SPtmqAT4Vd9I9ZWcFvikcLr64Rzs+J6DdvNd9Q72wJgk+khLbvecNJ76v6529xaRDPbZDEr484zo+tOwRvu+JfT6dBKG9WNygvYmKKr4gFx283/RYvCxlK75QFj0+J3c5Pty7wbxTbHQ9kWTNvIJD6TwIfIY+B3ocPctUhr3xHZq8uV8PPjaolr2hFNs9yyhcPZ7vND7LF589Efw+Ptv10jtB8AE+grm0vmtnoT3QaKi8TBiRvWUYKD0xAZQ9NptePqbZAz4k5LO9xPozPt+dBD7mRQs+FTl5PieZLL4kWsG7lHf2u9a7gj7sbnq9WwpmPb/OHj418yk+iDXmPApZhz0xtBQ+bvKIPj1RND4SIvK9Io3lPauOXT5K13s+fdPovd34v72nsEO9bfnMvQUwQr2VgiS+/hH6vcZf7D0P3WU+qfomPtEdvb07Wfa4EHsnPjNhjr5ltJK+v1I6viLDYz6A4gO8OhisPVvjDb2kRBK+2Uopvkmd+L1pzFw+bYOSvcamij7elhA99Zcxvp8gVz1dyjy9QlekvYV8ijyxDRI9II1bPV2L973XcoS7H94YvWA0sr3gW+y9f6jDvfX9Jz5PzRG+EYp7Pj6eorxAQV0+fxkDvlZiFj5qETO8Q1Mxvd8qxjtmb+i8gLAkPARqnbyf/wE+esNgPf5sjL4eHDi+3MrqvUUneb7BRBU9035BPsrh1j3Uipc++DMBPQy9sTzlm7q9ErGpOQ/nDTz37pC9vGQFvu+uwb2htT69IqElPi668Dx4TJw9FEG4PaZijb0T2Ru+xsLiPcZeGr77lRA+0Z78vQOVUj6Diz++p2gHvVdgCLshnKM61CuEPcmpnj0uTrS9UwhFvnJBBD52gL28kR8wvmxIUD5/RLs7rSgzvvMWxDrs7Bm+X/cHPpCMQz7mGAA+A7CRPXAhCT49JPY8h60gPhSwUr6qKAC+cNsJvoA6ET7iJmi+5jamPVg+xzsvvVE86NAWvVChwT2i1/I8O7g2Pn+bFj63J5A9w0iUu476WD6dQhm9jlK0PU8XDD6zSA8+bkoPPQ7Dr705kf8994cKuwvxub0oQzW9cL55Ppm6PD1TBN49TKBOvuzTfT5pDEC+n++mPGIh8j204P493zWBvuE9+D0iLkU+o/m6vi6AIj4WHvw94BnqPHs9rT3jrx2+kOEePr+C0D3x5qK99zdePF/zuD3TNjE9h6vGveTc/70y0CK+tNO+vS7HADxIGoe+aIBXPt7npT3yClg+pkGevOaOA77GSra9WL+XPtICXD1AaYk+oDRKPU1uK76LxMG+kLJwPQGvK76Hx3Y8NPudvZ3zC77Wo1e+jQ++vn5GtL3b6sM9vb5VPjmckr6vrlS+OIMkvVfcPD5iO6a+Hu8EvfaJSrtmStY9Ij6wPZTeuz7krIa+TYTaPUi7QL7G3GW+fTbavKt1Z75sAJ+8Z3iOvox3r7x96TA9p9s3PV4CIb7M7qA+bMkcvsSFAj6Ox2O+7xwDvjfPgT0u7Ac/RWp7Pk71HD66Miw+G2g0O8AsAT7EbFC9f6+gvLeOrbxAKSe9G94dvuidiD7EiAs+haojPYm8Ibs2/9+9o4D2PQXBJb6XJuE8twGwvp9+hb3JkL4+V5ccvQMbgb3K1wm+ZlGDPrHHI763DJ+9C5LZPX6OLL652Is+M0WQPBfV9r0ITiW+xl/wvXaErru2MdI9UU5MPdmVQj5BBlE+oBKsvYZ5ez6f+x0+gXNVvlTHqT0XBFs+NMtlvi/mhz0Q9LK+fu9BPoZLeb0x2gY+CREmPckfAD7aL9I989OLvWHTpj5N8Fk8bC/+PAyqPT62HC0+v/09vRmYaL4NSBi+ZrB2u0veCz0G1QY9YMjVu4E3Rz2XkkY99J2SvNPd+D0cZoU+YNUZvc3IUz5nome9nUBovepTd7xRKHC9uYmYvByvAb29MEo+P9lAPvmT6r3MYLg9Uap3PeIBCT6XL9+9/M5JPgdMFr01Rqm87YfaveQPer2Z4Ag+7l6xPX3yPD1SebO80eQ+PvzmEL3m4XM+mYYvvXIYrr2LfAQ+lEEMvZ/cTD1tlWk9fWE2vU2Rur2u/D49oEZLPjOEET7zjX49tEQcPZdTNz3zSo+7PL82Pj7xqj1fBdI9ReFyvTdrJr2pgtc9XKZmvp2UnL1oKSc93n8GPsVlFT7j8IU90vMmvc9SejxWynM9J+FkPlV8Cz5SPP49ByvSPa5OAL6pC7+9mRotPtXBqr2nq4w9WHEqvBmotL27NBm9c8pKvuJCzT1pRaE9c8cSveu1Ez76W0E+qSbGvaHsYD6F104+lmTyPS3fq7w7Jtm9tZH+Pb0Uqr3x6DE9MYOSPTbCXz5qjCg+tvaFPf58Pz1Hp/G9orefvVkayLzd5vA9y49OvPCuQD3Xzv29RdcnvoLEiDwnOca91Sr1PVLWSz6dCIo9YmivPSvpWr6Nmos9AGIRvl9Gzzs0lLM9gvw+PlKXID5lEGC9f6QRvsxIVL7JfOW9bwjwvQE6n7yQ94y9q5j5Pf32KD5XItG93V8mvkuhwDq13Mu9POoIPjfcpj2bdFk+W0AQvmO6pb1WNQc+yzB6u01v4DySuai9PN45PoMRUj5k8DU+SJSCPQ/cD74CHLa9E8f/vRt7mDznarK9VNJGPc7NPj7zA+48FiklvfP7Nb4QoEU9MHH6vKJMBT5AqT2+es7GPX1dTj30SDu9cGK1PS9SDDyfDk4+p2w8uZLcTz7mzwc9UD/5vb7UqrxQvss9udgyvpE9Yb4qUUa9cv0APoUYoz2ysN69nT2UPR3epDyROxo+yD2KPTCzUb5oTtS9d2o0PVoPgj1lx/q8zo2tPK3q9r1LqSo9fVvSvVSJHLvVZuE9betCvr9E6zuNGMU9BiPSvX+g+L0QCTU9mPvMvXX5ArxJYDs+DsyTvSuEjL4lYQy9ygKsPc0GhL3ctEo7QFShvZuF0T1QoQk9FrA3Pf5qDL4bfDW+OEx0vR+A0r23IAu9p0/TvDqMErzpxJG83BbCvU39F762Rbu8poNdvI64h75y2j0973syPad4u7wSA5O+hKCrO8GcXr5zmgK+VS3zva5ZJL5pI4o9wr8APlmERL7ZPgC+1nkJvn0fdj5Yzl0+pnVdPNMzAD6rVsY8Ru+WvdpjL74dBhq+u2VUvczsfD2i+RQ+Pa4Vvl9MDrwPX4e8AoX2vb+kGr5H10Q8TJhIvmzr+bzo1ji+FdtMvd28ND1rE1G+ndb1PBgpkzwaPAU9ji8jPhg4Bj72BiO+0ZVsPSurlD3Mnli+pdtcvfx4vT0LfRy+De28vS4JqzxoDvM8HiBEPnoBmD3u2Ka7Zua3vaGmlj0RqD89n1ojPhjttDyrRN29AaMQPoDR9jsf3jq+ppLdPVMzDr1F8Cg9ucPwvXSoQb6oJZy+vBzBvH1nWL5kyhg+SQNavMqqMD58Aw2+AHBUvuhZRzzoxDG+xlgUPsPok72LKGA9sTQNvm9BUr4gb9g9A11tPMSUP741AGe78HasvQ8hyL2CbVu+8Fr4PWa7Dz4gnPa9zW8qPsEOnLyU+Qy++B40vgDejb12ssK994dVPDXsNb7EAH++Idw2vIfy072fY6e9/PWnvWRuSLxG4pe9M5NaPt465Tx/b489sEeuPF1HFb754OW9y0EMvhaEyzxfKx6+nYItPWpmF74JLwy8u34DvhrpTT1EUe+8WIDLPeblOL66IQC+6oLIPQIE1j1HnIi+uGwLPsW8/b2+Itc972vvPAiw7T2cg+I8xFwGPgYzrj27EYW9FuMEvj/Mnj0yc+e9NcdDPjMXOzuNFxU8hpUVvcVtgr1YcaU8reIdPXhr+r2/35m9gmeEvTFgzz1RH3w93HCHPYDXZz3OVyS+ISthvkjaQb1FKhq+GfYXPkSknz40rX09ChLgPTZmJ73w40W+bXGbO7MsQ74dOz0+iTQJvqvzor3N0Ls90Eb7PODtHD6TypK9zNi/PdIryr0QET89f5ckvg9AGb2gLm29+tTpuugtCr7M4wo+mhaIveEw6DtBzK696fmtvapcyjyTLs69ECaXPczjib1DMWe9xh9EPrjj7b0dG6c9qginPhwDIr5IIxY8Iy/Tu2ia0DxrAbA9UPvbutJWX7wBRSU+lTmePUHDCb48+gu++g5ZPAwwJb7UAyM8fL1pvszoFD4Hd6i9MoeDPWBEF70zS7290Q49PtbIkr7FkwG9O+q8vSJEiL2JJO87XJ91Pe8/9j2e0Ja955oCvjC1Ob6uSe48xq3MPO9iEj6lvVw+LCRHPYPYiDtWwEI+RIVfPp1bmjsmYgK+5Re3vWoYEj77HhI+/ontvY4+Yz0dKy69a+IsPpDL070KsZo9jT2/vRBpz71Ebn89Sz6fOuQKwD37Cw4+hk+kvSXbID7+xkM8hHBxu1hSir6zKZ+9pC2/vS9zQD1cXR2+Y8eTPp0IOT6bobA9iRUIvC9e7rxp7Si9na/5vXM18L1Pp/O9POe4urURlT2m10y+SzIPvTP/jb0vQgQ+EOrQPEHLyj192+E9rywSPkrvHz1irxc+tY2JPsfgCb0OpSm9Hjt/PWTX/jzeqBM9dfsqvpewFT7PqCK9uqWOPZlLnj3XNjm99m6zPfdFgDzneY4+YnshPopdYT6cw628om1cvG2asLyPQO28eY5pvvQYXT2WNwa9GemTPQNT673bP/q9/rw8PkbyDD7yNz87HMjSPHDz5L0N7Ji9USEvPZ9wzD0a0f29II3mPXQHw73Q3RE+XIipPWebfT0a2KW8wzQAPbZdND4sgjy+wauOvTgTODwjUFk9mR7tPRCDiT6Vwsq6Pj3svaQaE77AmbE8pj90PA3Q/TzoTuU9yPP4vRflcL2xD208ZvTxPQfMwz2R4Tc+9WkdPsjfnLwPXWo8d0tPPpVGBLxjR4Y8/N/kvaKgRbsD19o9wxMLvlngWz1AMSw+eNsWvhzlQr3LQS0+IOAqPu4A9rwCN06+kr/YvRjHtL2T9Iq+6qV2vZIQBD7Px2I8xpiQvA8I4j1r20W870ZBvuZla7w6wS0+VkQbPWdKBD2rR609YC+Qvad3Er7i5mI+alaePQm0Eb7Tlgu91qlpPo0c1r3Ay0K+8ecUPRYE6b1WRgK9hh9RPiwfmz3kNhe9j2cNvfNBFz4pd2+92aajPflIrrpLymY9N40AvqWnsz1MMAO+uW7WvBeLyT0mpI2+l7dYPVogUz12BfE99zwAvkSuDT5cJgs+2Iskvg9guT0eIUw8VWzwvKiplD3ADd28F7lnPlRkVT6MYF29czJJPo8hIb2C0ug8GdMBvh1GWz1SGjs8qQPrPeecer1voto9eQ0PPtsqCD3/KAe+odt4vOR5vj3+7JM9fEQQvo2Epz3E81G+K/ACvkdRWz2W3wq+CTDuPbtJxT3zziU931Uevu8PgTzUaa09VAWqubSXhL1Y4dw9PQ2NPeCWNbzjLUk+OprSPKKupb06aH27beuLPlQvGz444BQ+sefLvQi0Bb6ZkIu9Dd+1vb69D76tf+A9kerXPem6yDyWh4G9OW8IvoVSV7yUigW+nAowvsP+472Xbn+7hDnCvQugbT6XEj0+qAm8vdDSC74ouCq+4gyVPGbStjwYuN09uEAEPVlcSD0hMiO+OK5WO5Lykb1WUdw9LPcDO+PHLL6y2ug9YbKiPXRoEL1XcBu914b0Pbboxb05fKI85hVyPdV+Nj7GZZg9i9TvPVJ7CL3N6wU+8yFIvKMDVr0NK00+GWyWPR94/TyRHGo7AJNCPu3E1z1tN6a6GzWiPfydT74Idhw9mXjZPbSe3b1SKTo+9J/7PEgZkL2TlLo9wjDVvYLGTzxYic6925L7PSzxLT0mGww+HXZTPsPDIL64zQO+qTJ9PRs7VLy+OZ099JILvlQ0Ez6GC+o9VCv6vSbaUD3VHVs9YsB/PTukFD5KOtA9drOGvfqrLb047N+89W8MPsIDEz316j8+IYeZvVuPgj4w3d69Njj/vVyBOr1pIaM8TTvHvVRuxD2FvDu9/jFSvqHGdj6rQfo9W2GkvXviKb5dz/w9FZwnvjGejjsAKBC+AotIPaNiRT2paiG+x7gZPkLlnj0NeA6+22cuPn/ljj2lweY9rrfZvKxyfz5dCGQ9pNLoverS8b0pZZC9vZtlPbHTLD0HKuW9pimhPVLqCT6JHx+8moorvtRpNT11pv29LdFGPqZyFT6DHxI+75r9PcabKD4bcLS8IgjfPekrQj5bQAu+XFW8PXO2EL5P/um9odJevV0wdj6DHgE+TKEAPmgdDz7P8rQ9ggJZPkj4YT7E8cE8vxYsvZIWHb0R7oY9PJOHPECgDT4wHL49w9MUOiuHsj3+gSW97B+ivSjiwz1yf2U9I4c2PkcANL4q9hM+t7gKPv6t1LtbuT0+Rqg/Ps5Nvj1APmo9vXmVvVfCuL1KbuW9iMIovuFXCj55Sgc+fQlRPhRqJz4BC6o9T/A0PlQ9U73NxO09mKJCvX/swD1/hyO9JiBuPf4mQz6/TPy9fkxHPvY5Ij6TGks+fyYZvsg95b2zvUa9YVCOPaqQ9r3G2F8+TlS1PVShTj48sAI9fKRIPlIBZT2RoRU9Ehgavmm/ZjxRVD29iYKEvhba9z11Dvi9Ya/9PZk5BT294Bc+D5MdPpB3Pz7/GNw90gJkvOC547zWVKY8t0JjPtmClz58l3U8lEg9vYxuBr7uYN69gtaZPahmQz7zfh4+rnkMPv6xPzxJ6fC9+WEQPRVZvT1E0xC97tLcvcR4bL5yS789c26NvfwF8z0MQDm+Ar4BvrFYGb7Iuza9C2n+vbe2NL5LCM49kgDXvNZMNT6OoTK9RHr2vVOnPD73tZ29jMfYPXPzBT53WGg923bCPeA+2zzG1k29NHMJvtbf3j3DsEq9q2xvPeYn+L2OgfI9oaFnPs3oDz4CC9K9UfVZvRsc8b1uRJW9tpgwPrg9Cb6v2ZQ8Mz85vXm4KbtKdIG8AxXYPK4CFD57s2C+pimGvbYZKD1DTP49yMyRvR+KBj5B68G8/ec8Pd+YAz2uzUE8O6MevilMWz7nRoi90oM0PXsMSb64wy4+2EiUvWDJib5wurI92LDtval11T1YYqU9/CvZvSXlEr4LVO29aVCsPb8SIL3t6RS9IK8rvqqQUD6GOiQ93d8fvoTc0T3CTc692I+WvWY2Sj3LbsE8mdGNPG684r1OsT4+C9giPpPOgj7UKZo9hPHmPQ4lkrrgvby92rdivduZuD2wLw+9BVYFPSGeDz5XnHo909asvWm3ij1EsBk+i7m7PeT+3DzlQjK9X3ZoPkAvo70AOAG7BCHsva+5D76lF7M9h/IUPdLoM75RTiO9MxuwvWIl8rxdUxw+DN5MOjkuxjwWeIU9crCWvRaXDr4kLJE92CQZPvBJmj0Lx2K9M7eEPYs1XD1YRqG93RtCPaZEyT3jM5u7m7qXvITzBz6R7yA+jV48viHA+jxfNu+9kBCwvQOx2j15dYG9uRvDvBj/lL17pBK+4utLPiiXcD2F2SU9KIPLPEHcbz07R/U9K6mDvQ+ENb4ATwQ+MGTdvdNCYD19ffc9kZjnPGZfEL5yAr+9iQ0bvoPh7zzE69y6FwM3Pq+UsT3kpMs9WrhvPfSBfb1C0Is8W2uXPISqZryLkMs8NTUjPtAM2D3uZcw7tAWtPSg+A70aPka+AvNbPpfLNb0n34i9WxXxPTSohT1wnEG9JkucPT/U6D1y6HI9nhrHPG5ovT0EgT+9Gsq1PXSjXT2tTOw9DRyhPYMLOL37Wp09g86rvIqF/DzQxPs9Cuu6vcEWtz2rSrI9Q5A7vRA0vT3Jy7e71HsPPjgICz4RKPM9eb0JvtseCz4QxYu91Z9BPoX7rL3c1/89OibTPZfysD2Dpxs96C0WPvrcE76r5tU8stg2PNcOzT3z82A+s2vJverRx7w2HB08ze1bvOf83z2S4mS+BVJnPe733D1X6kU+bk6BvrAPojyuRsU9qnyjPWODFj7SO7W8iWG9PXlgOT5VV8w9bBgMPqIDVjwVdRK9bv2YO6A9Ob1qbIu+v+BnPjNbfL3gjHU7S+BZPscDlDvGzf49ZgeXvTCS27zgnrG8WY3DvMDCi73lpvG938Hku02dOL1UI4G9UEjtPKRtsz3Y8q28Ux01vqnZ/7v7OSQ9cFw2PvJkh7sEAZC9WhQcPQitDz7ZqrY9R5dgPgTEBT45o1Y9BKm2vEL0Qz0A7D+8qns9PmhOFj2sDFK+/hoVvp0UE751ipw8vaxPPhYKWD15AAE+bnkbvgPDbT3ykIq9BjYxvt2nu71jYx892fKePPH/pb3TPtI9g/4+PjOt+jwrr0Q9PwL6PTwlX74SBL49lON2vk+pn70pbWe9BtRRvh5S1Dxu0kc9Q5Q5vf6Gxz19N0g9EUsPvl5MRz5k1NW9tjD+vc9eEr2k7Yk9k27IveaELz0u9pw5Nqy0Pb8X8T1Fux+9O64/vifNNT4tbQm+CSo6vYEOEr5RUPs9X1CLPdujZr0ixEK9UBVBPiRbeT36WZo9UaehvEofjD0YJ0Y+mdvnvHuWT72RMzU+A25jPlCNZ70cTk88Ipz4PVa6FD4n3to8GSQYviowzr29WZ49jrsivh5/9jxYc2a+cEeCvSZgh76NjWs9ECVIvZCalb1Anp+9uHq3PVJNpb02jyk+yuyvPXjGqj0tJJM9J88SPtpI4T2mSnU+xs2BO7Joi70fIQW+W3AzvOC1mD3NRsO95pXkPY9EjL2D/oc9Fs3TPGK/MT4kAbq9tz+qvaenFD7Ufbi9zTf1vfuIAD14GAm+oyS5vUrYcT4wcD6+e4mivXlZVj2/49C8CMdFvf0mwT2XtJQ9dCjMPeRWAr50Wom8/mKkPLNnGj6Axu29fwpkPgL+mbySUUc+Zi9fvi1Emb26wAc+SWQLPiO5aT64U/69a3oevpIy4Lt5m8U9Mvy1uwWTOT0twAo+WDuPPd7jZ72mMIa++BMVvtVSxT2lPEU9jbG+PJjy5L2DLLY9WHo0vgZvDb6Uyi28dE1JvkUfBz2qCYo6aL50vdiiu70KlNe9S0sKvpQ5ub254TG+KoIEvgqAnj0fh0K+mYIovFvtGL667BM+vMK8PdKe9r1gnRY+zXYTPofnBL7HqLQ8As8AvnlBrT0tvDE+bOalPPC4Q77xfS2+fa6avV4S071Z24Q9KAxJPjjbMz0mU9A7OHLmPIw/ULw1GLG9fZ59PQJnSj1kDiw+ySbHPfMGQz6Xbte9iVEOvUsTUT3HQBQ+uNrovcxcwz2ymqW9FqQSOk+fNjxOtLe80caQPovG6b02ULK9sx9LviBSZ70FEMe8bXVDPlNlIT5xeJ89qf0JPr5+i72rkRc+Ia45PVE//T0JVfe9FWYKvhC8CD6ROny9caKUPaef7b3pQQk+OFyavALlmr0UyRi+q3zavecYBrviLym+5wLmPfqLL76ur+Q9PvPUvM4bOL7ngvo9h28UvPnW4bzX9Ii972V9Pe+LcTs8Baw8Y036O+gtXr25IH6831iAPQawD75vZ9S8WgiFvEmQ6T0Hwx09mrzevarYmD1BKQY+gjiDPYx2mj6M+hy9sU+RPQ2jCz72dAY+7+QLPgBeDr7ITpq9Vv1dPQ+WAr6LcF08vAK0PahsI74oC4A9NEqOvcyXnb3c55+9IPdUPqfRLT7zNAg8kh4HPmDdHD3ThnQ9xglGPvkXZD2n7xq+WXEhvl8SAT55vxM+KuFSPQ216TzwZBy9cmFnPtAIkD3MlMO9uYwtvnHnLT1znms9y7EKPtiToztWc/o9yAoXvgwnCj6pp9q9JhRCPSMt0DxRnfY9JbDFvS7qHD0Ir7W9FUcsvtQhBj3WhCw+jKFjPbstir19lUm94OHQPRKxGT28xmk+MEidvAJGnzvXYg2+KrrWvLSxlzztbKs9nCKaPfF/Jj7PHgC+E/VivBYwyT1+s3u+n/wMvui8yb3mK+A9q6VCPq4Dl7u3Tno8KHhlPqNgX77QT4K8WsRHPHN5ILudciE+d/GqvaEUJL7vHEE+OggEPsfkbD3EC6g+9Z1SvbxFBr79WcS9H829vR5CD70TrRO8qM0DvZvsHz1c2TK9LcRsvRk9aL0uU668Pf2zPSSe2b2JOBA9eNw/Ppo1Mb3My2G+T/nkPSiqgj6oMrS8tXW2PUvovb2CsRI+ehHTPTx/3L2hvQ483nJNPlPo+z3xUfy84bITvTtiRr0zlVi+Hh+CvjdSpTxYU2w95CHhPbP+NTy0xbK+bCIcvqKohD3VAGS+30MjPI3yWj1vR+M9aiFJvgTK1z3Zmpu789dKPjaA+T2rXk0968EOvkboGz69QNU9Ke8kveKpQr6V4Sm9lI8KPqb+JTtjZg++XNYFPlsiET3qJRw+j4JVPlxKdj5LY3M+Vmwxvk6xvz3p4ZK9WJKDPTI/oT2ZOzo+VxJ1vQX4Wz1FZ7096OTtvD4Ny70KbRc+fPw+Pc7AoL36BQW+C0uwPTnLFz20ZL09Fmz3PdhKET1C8dg7wMGuPWAkLTxUpH+9VyXSvdHKAL7xf8U95+xtPjCBlz0dKpQ9VHAdvtAWObz2tii9Z0hvvjmUlL2HT4m+YBSxvWULnLpKAp69KQ6EvXlvzb0Y/0w+X2MFPo65Bb6CTxO+yr80PfMPoz3WBG89gXoyvn1vnT1uIBa90673vdXClD23xeO8Hh7lvA/NrzwXFSe+ety0PEpXEL7BTIC9RDoJPtpQwD2a98S91WB7vXX3MDzMxD4+jV1ZvsiRDL0Laka9aIzZPIIMsDypBvU8IGs4uyTh1j3bww6+Gup0vq0AQT6sc6e9JbVDvgzg0bw6c7K76JFSPgWbLj22bT89pNB6PXTi37yUO7G9E4wevSA3773CDxe+l+OAPfcgSL4X9CS8TutrvkNwsLyUqxE9craPPZf7Oj50/Vg9WLMtPYF0V75Qk0u+ejfJPZYyJr6yIZC9yrsVvgPUgL6oZby9xpUUvqK1eTwV91O+IUdivLI+ab3ykow+71RmPaBI5z1Qvw6+6oE7Pcyfjb1/tRg+pHFWOW0tFr7xXgC8CurIvQWCEbzWQts9p2MEvqwrqz13hUK+aDQiPlyj7L2RoNk9UCAePerDDb4/lbw5Hf65vUqYUb4WjQy+BRY9Po1mTrxpn0i+Kw+LvLYjRb0SuCC+kKABPl+zTL0AMca9jIecvBn9+L250iM+lEZHvc59NL4UyxG+LrOpu6zZiL3WLYE+4ThAPlcSmr3tNdy9fwk8PfMVtbshkAE+RTBVvRtGFrzEqj6+E8D6u+e83T3IcUC+HT1tvVThHT5plc49fszbvLYzWr7pgOI9TidavUH90L0K0zU+FsYwPqomvL33lec9cB9LvYqOmL21/OM97BgLvi590T0plwu9BDCEvWKj3b2b6/49WBb0PcQxW70rP5E9QbzAPcYpIT7KitC9BFnzvRuxcT03dgE+vniVu1g8KD1+Ksm7i/uRPXvqZr1e95A9pwNxPRAL4julBIq9HuizvMidD75RRmI78ywBvm0tAr6yI986viIxPoscQr5SKPc99rz6PV2Km730Gcw9wHNQvrqZjbxI62492z+nvb+MWr3oG+i8R/FoPape1j2ItbU94YqNvMxd/z3sHdO8f9mQPR84mr3moBI+DmM3vvaP970Ihva9f8BuvsD95jxCbxq+GDvVvJRzxT1x35K942/MvUqcSLttU0G9V+zhPat9jT2IAuw99LMovblbT7109Ja8nq+ePdpLUj2odjW+z5FjPel9JT7V8AU+TDfAPTFkibxpese9NSPKPXk9lr15Gzq+TuCyPfhwDb7tOR2+x9t6vkb4UT0jZiA+aLWPPKoGfT3Hzfa8A+4svRZXKD0Exmu+IKQdvr9LAD3i3UG+f0g2vio3mD2gGDG+n1pevtSq/b0qTR280jmpvYxKT76CK4E91jiwPFGxJL6pycI9BBYEPapKTjveRds9TDJHPeMaMr783gm+U4ySPUDXlD01d5G9QwYBPotQHL6zUDu+1uCpPYh4Ib6YGgE+GTHnPHRpNb1phRo9mlSCPKVXCj64+t08omtAvvrXej1vABG63JnyO7s9iT69HCU+fblnvSuEwT1L+607pl6QvdnxCL4PMEc9gzDKPWnY472WWQu+fvv5vQHhyj118Hm+dbTqvXWzGb6MPAW+N+pRvnyGD77OIwC9Al0VPodtdz144Qq+t7gEvol4jr3+7uQ8UhHWPRCqTb12+AA+waYPvq9UPb129iq+6grhOx5z+r0fYVu+y+98Pdu9f72sJZA9Vw3bvSDhWD0Mo2G7rkohvRKzLT6cMNA8ILS0vakM+T1lqOq8RnIWvUYuML40L/U9l7aVvdgRPj4gZYC9jsvHvWBJGb519Fw8UgsXPn1xVr6mwZU8aeM4PRnr/bzZQoA9eLDHu0mITT3pZya+6g7aPJdNS77N4sC9lmgevgA25j0ns6o8x/qOvlXPVzz8BjG+5tD5vasXsz327x28ZkIBvuXppz7C44o9d7yWPTZy8b1Wb0m+7IPoPOQoS745QV+9ynHjvZsxa77y1rE8or8hvuBbhj1KfZe93c+iPTvyAT6rNEa+mKTRvKuIB7229us7GKJCPsaHAD4F9zg+6NJ/Pn7DUT0+uBc+Y5chvLNeTr4l5RU+f/TBPaVANr4GyQy+6XDNPUWfub2oUW29ULUOvl1LNTwPUKu95JH7vY75Nb5jCIm+2c0EPlThADy/SCo+lGaeviP0xr1WcHS+UbpAvkxDFr7XdyM+E1PjvRaJkTzyxHK+z6vbvQM5Vr2Q5d09Yy/MvW9qUL0A/ja9rRxTvkQed773QoI90s9Qur5BML7GAMs9vleIPCmMAT7po7q9H8udvXdjXr6Lk/y9gzT1PcbMLT7mDxY+hLasvaHNkL6Yipm9nj5fveOSlDy9tFI+Ar9mPuyj0zwAjvS8GTJvPk2TRD08iwA9wCTgPTSJiL0slj6992givi5N8b2rwJq9lvI0vlvjMD4kZMI9hcTlvVZKBD4f8SC+vRXfvTVWVT1ddDu+CH9yvs5Kxj1PYyI+TZM3vvozfb6Fm729hoWtPVTsNb4mYYS8ylMZPnugJL5gZwI9dpksvTZfyT0inhA+pnmIvdeX5z3zIwU+k8AbPRF1Wr7cxgg9/GOFvZVK4j2C3da8ebqPPLYfTL62Zj2+LP6Yvsh1g764Bg2+MC4YPloMjz4aMDO8wEiRPdo8PD7tE9E95D+TvVwsaz5BNFM+yev2PT72Gb1KRDu+lyZBvqjSYjrenvo8zF8FvTRvzb5Z5lg+LuwWvumRhb6ACSW+FNpKvrV7lb2bPAO+JLdkPJofY7w92w6+gbXHvEhviz0BX7U9cV4EPkg2yT0Qfy2+i+oKPsrd4T3kssI8ySmFvX0LDL4K8SU9dSARvkNuVL6UhzG8TDapPdc31j3yQnS+0yuMPck/rr2PVcA8usYFPtsZmjzsWAY+JbXcvDXwmb1zQPq9CeetPXeaEr0K0B691PsovfxZor3gx0g+nOsfPfb/1b21BFO9E/0PPe97MTwqASy+OiAJPtRAqD2gpJK9m+sNvWWssz014vq9To/lva5luz0JWwO+QLk8vDeaDzsRFf29GI4HvpEruTy/krA9h9YavmhhET3R2VK8Yg7ZPU+edry3zsk9JvDnvVaJP76dYeW7ofEaPUpdh73xtpq9J98fvpII97wUv7I9nt0tvgruCL7m34G6uVaxvW00g73bG9C9O+MYPd2pwTsZYzo7tkEEvbDWLb6ZDMA9FSAgPeawXT08g6Q9qJvMPRFhk7w+QVi+V6GiPQCII77Yp5g9gzi1vWdH7b1Qm4O9KO1jvXBJTL7Jsr09BXCUvdOoKb6zOWK+j+Mavh0D+7sXcGM9nms+vS5EwLp3GMe9TXZKPeKx9r02BPq95KUrPOQic74tnUK9AOMNvi8jaD0Gd8w9M01IvomOhD1S4zo71E4tPAghP76tQYG+9CrzPAiWDb6VDEy+O+K7PcTc2rrlHge+Yr8gvgIFZL2/KpS8ltIEvrbDGD7R51g9bmPuvXDyFb77KBM+MBK9PRMzDr4zVss9wvtavmVJYr3LA8i9G2JdvgIRfDzLlJ+9/+eEvoGT071wWC++oSOkvYAVnz1vN949xe9wvq2oJT6zzWM9ZWxbPWM69j0ypz68wSeYvW70+72EUym+P940Pf6RL75U6rw9RFAGPsidSTorMAC+HSYOPmvQdL7D/eq9S+4xvRcUvz1w4Kq9Ew7PvV0m2z3QrjG+Q/1/PS7dwj32c+w9KgGAvu52Qb2bbzc+uGQkvnDgQb6+BAu+SLjbPB9dJ74dhMG9p7CFOxSQhb1BSXO9g23GPW/PxDxYmDa+BJDuPFjnRb7S35i9jvjKPTsmG735c2A+DTqePWxrdz0NHcy9L1VIvgxVsL170A69a4fXvKLnrT0r1Im99TrePbo8k72PsRm9X1qbPQCgQ72Biwe+3cKJvIMEPr5nt589xiRUPZSXnD6i1JC8TOWCvq9KKT6NZpK+pCnJPR53Rr5GsYe+lZ+avYLhxzxuV8o9QGYavukqeb4SEJa+cHVJvvI0Bz4s0gW+ye+Fu8Sdlr2HbtU9fxxAvnrS3z2ALCe+vSgovG7oFz71aPG9mVi7PU3mJr7dvIS+7leyvcXkBD3chS2+EhO0vUw1Bz6IaEW8JbIxvgHtmb3ugoC9fxVVvuamir3Bweo8mGKWvW0jF77s3WK5PFMWPkr8Tr7v4Q0+3I6NvZOibL4AwWG+cU7Mvdh40T3bhCk+H1qXvgdf173VOiy+fd7fPfqUN74Ws1E+9rlvvtZDWb3wpf89LVyWvfj3Xz3+iYu9XNf4vSVOZz5G6IO+oJqevYnQhb7l8PM9O8p4vS7lDj2jy5W9WWV3Prxrg70nsvm9TcJRPbjB6bzvrUg9HDCyPJsKDr2n4me9JErgOyv3nz0uvGC+Yvgrvo0G4b1A5XM9xJAyPqO5Fr1fY8M9U6xjvPHL+D3CkCc8VQ+TPdTxNz5klBU+fdoIvVLOlb5ez2q98UA6vgkiATzxBxK+cOOPPX8yZD60kRQ9XyVzvotGwz34Kq297sR8vpWSaDzgviA+nGHsvJ1EN73j0A2+ertLvl3zcb6oAbw9ueQFvnzYKT7ncwO+n9vXvauVBz1tcso9Naosvdt2Tj5QGAs+w1iCvInu9D2Yz+I9ZkqQvGdGQD1C5dw70uUzPZZtNL5dFDY9/i9DvjUa7L2ul2q9AM40vGi5gDwFyW8+NLWRvftCfT1dKjC+W4EhPRA8GT5d+hM8GCIRPgTzDL3ZZ9w9mHMSvk5hkj3RREK+68TiPfK1B7yZN/y9W42lPsqLQj5gn8i954/8PZOTGD6VtpK9PG4wvq252zzb5QK+CIAEPnNX5z0ItvY9Zlsxu7b6Pj5JRgQ8O8zAuzeGhz6F7709t9o+PeeOnr12INc9peraPZ4uBDyZCkc91FhDPDtUHb5YZVc+DH8EvqqxND5ecpO7Gix4Pi/oI7y+nRe+kCXnvSAp6b3Ed4M8eWZBvWLJqrw4ukY91uuXPYtCyj3p6P+9aVKDvHm0m70zY8u9D0nUvYYW4T3lMii+DjPOPXIppj1PM+W9yxawu2dAC74Qj/q8BKEoPj6+LD59VCW96oUZPmv73j3eGhW9heb8PUoT1j0rsC4+XPhrPPc8uDzzBNK9wn7dPboFAr49lNe92Da0vEn8pjvjr1y9RLKsPfixmry75F+9R3JNPi3Wbr1Dvc09lUTcvT2pwzy7WaE9QdwHPvGk6jxF0CY+oC8dPmLr5j0Q7Dc9uYdPPk5iFD4YVSe9bvZAPqbX+rzH2jQ9fknOvRPvwj2f2zM8PuLJvBJwjD25Kvo9i1ZOPthm2jzr4xs9yD4jvpPr4DtuSug9we7lPSDOOjy3tkg+IsH3vfetnLz7V6Y9bNxRPfdMBr4uESC9JISjuoK7+jy6+Aw+09PgvHxLEDzvoUo+w70xPqE8/z0rvBa+QFpCvarVWj4iq7m9SK1Dvhw55r1j8K+9mSRgPrWJYT0pSy69M/DFvaEnKz4Uzwq9BA8kvYcSwr0bJx0+OBdEPQrNAj4q2+67IsLhOxGjbbyb7X0+w1czvein1z1WQxQ99ZzavWhzN75QlLo8MP92vrlAAr7zckE+HHHEvSvMXz5RmKa8cFcwvu3RBD4Qoao9glMDvbTsAT5LBgK9nPLrPIE0DD5c6PU9gJNkvkXxyzwHvny9VD6kvZHE77xT9wA7DoRNvRqFtD2CPoE9pdQmPWbeyTo/shu9TVoRvicOxD1DQvi9HDFCPS0zur1HCua9LRnDPW6qPz58AcI9zbUxPtMsYj5FYcw9F5eFPqy+OT5GEYW+gF9dvYf+Gr30FgS9OhYiPdqJJb0wg9898IkxPtLSCzrwj269XDpIPAGn7z3O4+k9d6xEveYo67329so7lajdPaUsOb4GMnU9ZwedukXztj0mVjQ7wfk+vutsmjwGzAI9wVvdPf7gTr1zsC28iKMSvdm6yr0CjwM+jWIrPusjEL3WzFA9DzKOvhh5K7580S49TuGXvQ8ogLxA1Zo67fW1uq6wGD5C3wy+KJ/VvZA1hD2oQ329VMQHPkNhO75Icj4+1eUfPg5rsT2RVYu9qhRFPhD5Jr2NHMK9JXAnvZSrlr2YSxW+LTGBvWn+G77lL6g9/YkYPi77LL7pbP697vDVO3WcSD22f6O8v6h0Pnu4mD19AQG93OTzPOO/gzyhrxi9ZUDaPE0XOD5KDlC9uKN8PWD1Cb6tvBU+tNQnPm2XRb5/IiQ+Zw4Zvmb7Gr3bTiM+cZLwOnk8rT3oyc49W3OiPT2BUD3+XSw+fx3RPbHGjb2ZIx++tBkaPe9SQT08YVo+qAdivZlMb737TsY8TOaxPb+VET6TTM49l1R+PtC8BzyDKAM++8LWvYl80j3G/aE90PgMvQNdKT4SH6k7CqdMPj4kUb2YMwk9YFfrvUeDXD2kF8m9lYwbPeiwhryvZea8WF+5Paiel7ydxoy9UWQ/vibBRD6U0B6+ilg5vqQxab4cxKa8fJQtPpLsTj787ZC8LMxkPbXUPr4ts949B6GMvnWUGz6kmso9AvKDPdJRhb10EyC+TjaQPdh5TL7sHi4+NjZGvuCKU74yCxY9Xl4qvLFC1j1uPiS+AC4aPV0OOz3DuKA9RWovvoqLET7LOpU9FfM4vYVrCb5k0gm+e/UzvsYAQ76E0ia+mGVlvRYvmD0+Is09cbV4vWy4M74suQS+V/0XPK02Ez5U3Le9AEeqPSgW2j3Y0Cy+k6UJPhk/Wr4Z9JC9Cs3+vbQNZLu9Giq+3O4Qvgw9uj0c1NM7B/b5Pa63yLx0MZi91850PaKEDbrg3zM+pPreO0rCbj1+MvA9rKl4PXUKQLxZooQ9yKSgvZnRUb7fCwo+ZxOqvIwkfT2qaCa9LWUwvvmCqj0ft7e9t1L4vIdrCT6Aq1Q80OpwvDhuDz5dUXo+/oZiPiTy/D1tW6s9BD0IPj7BjromhlM9lKlXvNvQGL7E1qO9mP4jPUV5Tb2oRwe+I/jBvfkBRj3MlVq+hJQjvspZE71CQu0958K3PXdr97xe4/Q9xPXqPQF7BrzZTpo9cdWevfv3n72weMI9ikizvFKmD77hZ4c8EDV0PcDtWr4Vrh++OQpBPe0F5b1938I8IzhFvlYgUL4j7rK9EXLxO4gKXT3Osw48WysBPr9TC7wz2g69WoJJvQV+Az7kp4o9FLnkPRwLCj7/5Ka8zjn2vfJsoj0mhvS9W6aLPV+2w7xKlS2+59y3ulQedb2Q/22+K2IzvpGV/L0e25g6A7LMPH8x2D0NIsU9ba8Nvo6dbr5rowM+0tWHvSzbWz0BNio8By66PfYbfb73ESQ+xwGSvHZtsb2SKoK9haQpvikVFT6nSBu7cdehPRxxub2xxQy+jKF7PbIkpr1t81G+Om7MvdzGOj72AKm9q4RKvQ6sQb3x0d29NGv8PZmgtLzsnM892cgwvg6rUL7mSzi8ENXjvZD8H71YHKc9OieAPVClK77riXC9LwwOvp97Y72UENa9bG8Fvf1fkb0Quto9W0PmPF4/Ab7fOuS9kSJKvVAK5r2rWFc88JeZPcfglL0S+M89ny0XuzP3x73SAOm8zNzYvVAMabxi6Ak7/JccvlLQ0TzrDkO95QVtvZIPH76kqnW9czZSvsnRQ76tL4+9nza0PDabVr5fAzC+7vxIvl/aUz6hn4U+H/dfPpWU472oIBq6u+HyPTj1qzmEyt09JLtQvghUV7rlohW+CML9PYsySz13DHG+ICHnvVNyGT6T+1c+y6v6PY7pgL73h4c6lO4avsOdsLovyX09UhVPPhpJHr4pUQS+KG0oPpSTFr64CXg++9guvacca76uW5E9gDsOvimxTL5MgYE+onUFPvFPQr4lCbo8vbeZPQfOrbyrena8AYPFPB9/wr1mBoA+gDkevA8f6Dw14947jnmEPI+cZL7Sy9Y9CQIYPpsOLDwV/qO9MwzCvBtRNb7mF1i+LmTlPe+h0b14sAK9REyxvIGG4r3NCSo+OAlEvtAuJz73VP897oUMPvHgOj1ewwk+uR3fPdR3Rr2MUXu9c2GSvic0Ej2LM/G5Ht9DPuo/Rz4vj5++1GYVPmSOoz6KsC++pU2vvUaqYT2upcg8OIBnveuQDb5Pg1K+Z0dIu30qtr24Xr89Efovvjvyuj3ws8+9RvwUvliqQrzYOE68SdjXvZnlkb1Hhn08XbWgPTPQnj0yTm49ZF2OPs9k9z1GXOm8DLkjvptOb75ElTK9UfXwvRCg672AGwy+GUggPL36iD2kGPi8EOO+vHblKL4jmok9BzouvnDQzj1tzjS+sU3rPU//Zr4/awU+Klqau9X/r73lTla+QAWMPXlUdr3M4nA+gg5ovlPXUj7lCAq+M0kPvp/ndb0tHso8Z4hDvavNg73u0Um+DD5RPQRYT77VVR++ZXQAvgo2Hb2kEYI+HeNNvkU56L09W0i++fmgPBvRqr28iMu8c+gdvNaNk71xBPc9IEJlOtLCQj7tJ4++Jz7Iul72YD7OLjk9eS+hPZF/cLpjYRG+D55QPgpwQr7ctRy+foaXPR2fKr5NH/69x7QhPlj31j18qzU+Ro6CPrvEEj4eNgU+3IwGPowdgD5xmxG+BSGFvgHCIL6MjwC+UWudvn1xkbtL8e+95aLqPJwBgL6ybT6+lr4gPj29Sbxgtj49B3wcPf0Bbjw8Hse9eFEavshfK7zw0UK+ccwRPh6nBD3I9Am+Yyl4u9C2u7043XG96bDXPcFwMD7Ymji9aChMvs82Rr4hdJE9ILNAPC0L/ju7iKE9BsrLvfmU+r2t3ZU9enf2vfMtpr3ttDG+hYqOPWXDDj4Rr0C+GvvzPI3dgr03mjG+8HYqvkPOsjxfQCa95swuPgk3Dr7+mC29FAOhvfjSkrxyUKa+ub8tvso4S7v8ARy9OFTOvZqMXD6QCkq9hhrIva5LT771DuQ88NATvZChAz6gH/m9KyBsvY8tdT50sg2+MlYJPlgwdbyDXCY+P5n5PRJWxj0Tjpc8lmzFvVNTrr3WVTy+l1umPf03Hb63Atg6MeAvPuE7KT5t5pi9bhMsPtgHWz0uKdC9TsfsPfXbn725fBO+pBgdvXtyaD4rHHQ87TpVPV24+L2/bgI+SIK8vJ2N4LpXEEM9sk/aPSN+C77Qz4Y8FcdWvY6DWr6+0Ma9n/73PRp7jb1nMKI9xHDPPfFD2Txj9hm+nn1UvlVoeD3QWkW+AXWIPctlhT0XJsG8mMfxvTiLbbyoqQI+PEYgvuGGYbyNx9g923UIPjhgIr602gM+sMbtvIDa6b2NZqE8c27uvFdvOb3rN8+9/7/nvcx7rb2B8Sg9aqnKPRy/2b2wc1O+6kULPny357sam7+9Zb9evZT6WryeMxS8rjAGvdwZyD27uw6+z+0nPCBOQrt0iAM+C/zdvZ2sirzcVxq+5UuzPEwFDr6eHd69qRD9vaIUJb7x+A6+yMjGPXf5GTx0eYq9g35FvdcqXz1pmVs8RgqrPYxhnb1wbCs8hFqZPX2Ji70TJyE8mGwDPjdnIDvN7o69rRnevY8sUr4hskA9WHvjvRDd8zzMfMU9LSdBvYTFMb2ohMc8rPcdvvmQtLxZjsw9Cxonvhg0nj20+tI9cUECPtMxuD3LR0U+1cAMvuVJIT4PEiQ+u1pFPoWd9jwqM6Q9IdnDPSE8iT1662E+B+AHvs9JhDzQRrc9rgJivoa7UL40mBC+KGTfPd8Nuj0imVw+8k1vPUUYG72Se12+NoJ1vc9Wnb25Ap89Svn4vO01OjxH2Ro9S1yzvI3f2D2NI5097Mu1vXIvgb3gMSC9OMCOvbFzpL3Q+QC+5HEVPuinKr7iEPo9McTfva3fQ7yDtGk9xgNJvdecAb40gCc+/keLvsDtNr3F41a9l9VPvs7zN75eL/49Rxg5va7JkL0rJL+9VwjFPSMO7b1vzh+9bdE7vbgVDj6glVi8qZi5Pa6VFz4vx5u9Qua+vb9esD2gQoY++yAavkx9FD4ydP09ttkIvgCX/70kU9I9a1gWPsrqQL62SDO+SIJbvjo+9b3WTN08MLmVPaRywD2Sl5u9M4fQPTrlZ71knBs+ajq7vYTVSD2ZnVk+ReIhvYKkhD40QIS+VF8lPmfVPb0Jb6o8WyiXvSMY7zzrrim+SGyYPeFvhL5S4zW+NF9avrrLTb2OS9Y912yDvSoftr04yZC9syIzvkNgp707Tg28BSvSvebzebyvrT69HjCtPf0Aqb32AvG9/isNvlU2OL29BBg+ebsCvdZIGD5X+yK+dPeNvrJ6O75TlR++WQkWvtwANL5Ly5Q92+2Lvc6UYjtijxq+6zYWPmcNLL5DbNu93jEJvo11b70nTf29F/QOPbFK871To4U+Wcs2vPpwib2i8My92CRavZ665r2HRO88D8PQPJX8GzzZnyY+hkQIvmmvcj0EATS8oHsTPjcE4T18B5m9qK1vvrEBW74ecoA9EchAPc64rb1NcZu9rjEkvt4ng7xmXis989wrPatIyD2Z7iC+zvK3uz+5Kb4oz+e94GISvmTjx7vjbWu9Gm8RvYs92z2IkaI+5BfmPTFkYT6v8BO+surfPHe4MD3e9QW9FzFPPsHPAr4V6Fi+5pYOvorgaj1vSws98yUQvnXgVD3x51u9u0ZMvkKzij7GaV++aIDevfwsObzTYce9yUmwvm0giT3MNyU9KvR+PKGBML42oUg+YSKBPZV67Lw0TlO+I1wSPtxuUL5YeLK9/wYBvkSJX72VEs+9dV44PfD+RDxYvl0+4JCFvIOaozy7pQE+qNfXPahi472yFte9PvkEPqLbeb7Dxuy9F2+jvZ2fCDzFvF4+mQqNvrgEWD6BAkQ+A7cPPW4tAT4IMhi+m6Zwvmlaeb1B8No9mL/LPFaCW74sCss8riOWvZHUi70Gf0o7fNrcPQlrxb1FWoI9qdlivX+Jjb1zGEi9uzblvUwA9b0McBI+lhMqvgrZojrpAVu+dwAjvUAnkr7wfKG978iQvRXGRz7V45s9hUMjPq67Vj7zUQy+W+azPKydkjus4lU95xuKvY981Lw643O85pCTvZ+Qr70tdvw9PsKtvUDRqDx8bIu+YTmTvR6Jyb3O0DA+H66lPI/eDT14LDM+6UtIPG+0RL4sV1O90v2DPZojwL3Y9b+9gFLAPb9IK75Vp6+99ywdPsFy9byBexQ+JTwgvi/d0z0XUgm+6OcBPpEJLr6Z2Pm9PCJCPKLBNr4bzQC8p9/FvPvY5D2jnp09HpGzPRSF3D3z3Vu9tao5vB9ltz36sUk9cgIMPnIEND4aAvY9DCo1veIZA74XNK495JcRPTL8Xz40usy9j40tvllnMb4+It66cuZmvW0SGD67oYK+9zLBvSUk+r02fbo96MiWPOKdbTwUHIy9KhMCPcy8tLxHgd6838XtPSoFrbx16Mk9RTLTvRLhhL0WwTW9A1gqPT0AHb7d2AG+k4f8vRugET435xe+xPuEPZKVJD1aCui8HJ9NPf8lRT4JLE2+SX2OvdOPLb3vyMA9MUkkPoNIQL1lCw2+gXKAPYJ9yj19hSc+11srvtOpo73gzyg9f+4LPUHZv70DU8A8qZflPQqDC76eKrK9Qa/vPKQK5j18K+u9PPauPa91hr2ctk69jyCbPKhPirwTm0q9W6o8vQqX77pkYa08kmcyvsaJIb03Qr88rCuuuntnJL45vd89DAX3PYq0Dr5zK0E89bhePWMDm71hryc++FiTvZ4d/r3sJgy++dihvr5zTb4kQj09ijc8viIFTrynCIw+wl5iPRwpqru4+QQ+77MTPqNdQz0HRvo9woH+PQ3hez1Y202+SQYhPYCVNz21v1w9/f9WvlPd2T3xck682uyxvVK2Lb6EDpG9/EpBupo2/T2zQBU9cTSWPUQqe72f8fA7tEXjPekc9jy69JM9+FMMvTiQ0zsGh0K+8SnDPI/pMz72oRC9gbxbPirba75spAs+Yg0ePjuw4T3qUpu92aIvvpEP1zygxUo+hyhLvdLk2r3HOee908EvPD1tMr4HAW4+ocpvPbWnnrsD3Z+9qKspvTxsDT7XkQa+UwLWvQoXnbuyjxs+zIwnPepPgL4g6yY+kXiFvN43ED4gqFA+soeSvd6GiruPRjq9BP+APisUNj7l3Y+9v6uMvu5PUj4UPp29R78pPmu4nr3ZpBa+r4rvPCQgSD6Km349N06HPZC0Er7/Yks99uQyvqP5370kISM8I+Z4PViLW72W+E8+2VDCvFLMCD755dw8mKwlvgioET7bCbO9I5diPWROWT0/OoG+RvkrPoH1t71AQXG+8GYpPrsocz6U8Rq9kUITvjCJ1717MAm+naNCvhSnIb79skq9Q78Ivp5XUz7m54K9M3GxPb+nG74qc9c9ftk5vhSbeL0kBVG+1mK8varx6j1cvFs9061Yvtl6g72XUBm+7wWJPhHmQ74HT0Q+V+8TvSFhuzz7BvQ7ZuA6O7bpvL3UhpG9dBizPMoeEbwjjsA6gwTTPbWSCr4fhSg+DIGhvYRhA757Q4M9ENWoPX0sc75TfUa+vrwOvrwJ0D01Zgc+3zkNvrQ3ID2cu+A89FEVPZ3Yrz1dSNG9uEPivVWBFD7PgiA9HtfYveLI3DxB5sc9gKqrPgHsGr6NDgE9HzUJvOq1gj2yksw9SqGnPQCDRL4vpLG9uNNivKg+z7q+Oy49L73QOtIKQL6rL8W9qtM0vvb8T75SzRe+yUo8vf0tPL2yOr098MwVvonFpD3dQg4+jnKZPWgF/rsflIA9z0DcvZneyT2pSom9JzswPUmayj3Pr5e7NkYAPaYEBr76wro9ewslPmUEPz3aXKm91gbJPEleeD1wrW+9gZYbvozfgL2bo4C9Kv3qvW9qQT79WTY92uogvpAXs71yIbG94Ec1vlO5AD62OFW+npzHPdlZBj2zYYO+V9j5PYCN67y1zIY9fIQCviyFS77ECiy8RqYIvlRsnz1OkLm6vwscPik/KD3gyJO93WjQPE8lq73w1vw8JrGzPT5cLz41P8S9CbXtvCwADr4iUNa9W7uqvSd/Nb3TnOy8hTMCPqVgJj6ITKm+lxyQvao+DL79aRA9mLa3PUz4QT5FujW9MHjTvX0hrDoZuA4+FrjEvCc+LL7zArS9WGOSPNl0GLwzZ6M98a2XPTzeEz5lHyO+vfL1upXBGj7G2v094rtCPdHFIT1tjNy9oe8HPttjuj2ZOR8+YZ2/PaFR0bzQwMI7E1EZPYG2wD13FNa8sukevkg9nb3wwxU+QfZ4PbpctL2d2Bs9NKQBveLrK7schQa+WOaVPYrbhb0xhCO8bd7QPfwrmL3owa88a2qgve7A4DzA/Xm8LngHPtGC9jw54wG98qSBPdL5yDzOO2W9s15PvijCM7xaWiy+e7O4vBUjRD5jPT89UO0PvmZF5D2TwKi9G6QePsD0jT0G3QS+Q+bVvQ+CKD1fMAI+lLQjPhOV5z3lZoO9JK9EvTumAr4qd2q8Plo2vqZoEz5viZ69bkVLPrxWvjzIYu896iuuPUXLAr436gs+qCmFvQFsRz4IGSa+kWS5vK5SFz5hLQg8OvBpvQayGz5sbMi9nZ8VPnQbjT1Qeyq9goDBva5CsDzfLzM+zp3WO8zMrryoXe89uL38vRSj27uKQE69jyWLPUVcr7sDCDA+m/PPvfAYyL2LsIg7L9QgPoQRu70Z8EW9YdQKPpq/fL0lBDk9Gi5hvhtgYD2ek02+rvLFPdWTGL06v4E9cDinvXmSKr7hVBI+l0nSPfQOIL4xo5g9xsf4PDIZgr1Pwc69zsLCPOj6zL3/pBk+aL1BvtZUBr7US4w+AiUBPiAZLD7ag9W9dwKoPeohGzzy+iU8irtcvVSQFD7xZYS+/0prvt9xjDwKxCU+dDxEPj2El7zTlRE+57QLPCPM971i7fC9gFQfvnpcBb2eEIY8ac1gPe4/mD2vyUe91yIJPWwRET4p6329e0uzO5k5eT3sBM08a5SCvRYIyD1z7ZC+r6Rrvmgpjb1R+FS+qUHePdb6873zkYo9+rEEPkKR7z3giXk9iAAdPfA/A74VKSo+QWgIPvVAwr3WGis+fE0MvK1rRr4wszs7DFQoPbezs73a0ys+KDmCvRLTHL6zhQg+GsuhvZ9FUD5ZbZS94qg/voV1lr1oaf89ta4gPsPWrT27e9c9ul8pvv3Soz28hRA9SRcwPZSeEL6oKHE+z7ulvf4oIj6lMuq9iW73PYqFEj786J09qElLPiYaV77ujEG9pwOWu5SJwj3SH+a8lou6PAERKT5yVy8+B147Pub4O7478iY9KmwevU96XT2eXp09JNg3PjsDbz3ZPow9DjHfvEuFt7yotIy9x5kbvvWkMr50aBk+iVHJvW99ET5bOLq973AJPTh+WT4vRCo+3vxpvls81Dzm+h89PDEPPsFbOb3TVwk+8y27vXsgIr0hLsQ7XQCXPI2kwz1ANyk8F0wKvRpF/b1A2N492ccTvSZK572lD+69Sp0zvgFWFb7igDO81ze2vVKFmj1kjoU9pI+PPV1dvbyndIW+kUwpPizgkT6mkS6+S63kPAzMfL1kr6s8UF3hvWI/gT6DcNy9bm7lvIHJwz3j9e69gpC9PSY757zMDDG+uq9CvWGXMj7dUhG+oZaIPftrrr3yBpa9psD1PQn4bL2W8LS8ceHbPOr55zxIWPy9kCzqPG83XjyRcWu8SsdGPhzkSL0trnO+FWK7vT2Mcz7PXOW9SVQ4vlSR/D2UX+U9ZewCvV4vq7yxmkM+gvePvZE9Rb1nL3w+42N4PM2Xd74cGhG+KEg3vqnkzb2kkQw+ae/dvVP5LD4nn6q8Cpy/PS2y2z0b24w86HfOvQPLEb4g9jw9piSvvYb3ED5SBUO+OjBAvvDbMb3U5T0+t9revUDEJ76XL329k1WHOW04KT5Y3/g9n5mfPU+y7D3OT2Y+dQ4HvfT/s7xv2UK9fNPzPXooAT7QCyM+bC8RPqR6Zb699ge9qB8LPi8jmD0i3Jg+exwEPthtaD4Ls3Q+TdwGvuVAbjxs67G9FeAQPq7xXr7F0AG7RerhvT566rs05ZE5PUevvceeSD4/XIM+RPAsPc3iGz5o+x28Ba/mvXXwH72a90S99YJsPR/Ojj2Tkt+9ZQwVPXR5lT1yE3w9Ex1EPiyb/Tv27Yg9dHw7vlFo1Tw1x7Q9RnAzvT3FUr1NPJ86CEyTPQRaxb0yD2M92msKvhBbEb4bzCy+NUDlvTEu4LwZhlu9Q/HDvQ/hzT25mEO9oY6bPWCSG74/g0u+sJ6EPS/IGr7KXNq9BHXbvTszMb7czd08Of3ZvXZF2Dy6i0y+ULxPviSoN716cfo8WvYQPd0KjL1DOKq9NwzDvCIVKL4+viO+40UvviBPzr0T4Mk9S2//uzUQKr7TfUw916NEPeR9uD2NWiC+iIG6vI2WhDwa/1y+UsK2vcPLMr4FsgC8hlETvvuDsb3PlQU+H6UzvtzmXz08MsI73W6ovZfv4z3OYJE9RM9jvVqyAj7505k8LeAxPTj5UTzTUKU9VokavuQUwb3abTI+9NoHvMWqQ74gO2o98pgGvY/TLb4A36i85cUfPklfM71nJMA9eKsNvSOonbwMjrm81U/LPZzNwT1Eae89bxM5PURTlLw8IjG+JRujPY7zFD0uL0Q9ewIZvkqsRL7xQ8y9zHkqPZTMIjwoeiI8tB8SPfANRL3tB567YtW9vQTdtr2m/UW+MSMXvmlA8rzvgSq+WAxHPXUkvLzWN16908uDPVS32j0lxsM9fdcTvszoY71BRyW+TyQLvpci2L3nnEe+7smNPADN8z1+I9K9QqFGvqumBL7e2oS87pP/PKiGmDwG7+Q96022vZRlKD5K04c8MaSWvdyV4z2Uo3U8++ELPcbKOb7MbKS9R1NSvrjQhT5EglY+EaEMO9Pj0j1oiuE91vTeu/QpYr32U04+igaFPWkuxrw0FAk+teZFvI+TdjzPvw4+D+ahvTgRDr7r72S+Qe+RPc3fhTsSM2e9t9NWPqNoAbxi+Js94JUYvFgDPz7jfzg+LFVBPkAxUb6fBQe9FrOpvOvgzT3wEI4+mt/5PS/ZRj5FmGc+iam5vflzmT2XLwc+J5BvPXRP5jzXUHu9vrS1PVsd1b0GcZe7focrPl5uKz7D+ZW9jxA8vXlN3TyzRQO+sxFMPs/Q7D1bfxQ9o0QPvn4/oT2vYMi9dHiQPbiD0bzQDPC7N82HPpEd6j2ApzO+BTM7vlvCDD7QeC0+beCUvQeCuz0W+0S+ndhLPnSTDz5vDYk9e3w/Ph/Azz6TNTE+ozUmPfv2Ij62G/Q9uJtoPu+4B73rhCy94hZIPWAJbz6QNRO+rmPMPAXxzj0gpZe9iuYpPt7m0b3qcok9IXYoPqTcaj7ud6K9U74bvXGsozyy1gI+8+AMPnPvKb4cHZc9eEZEPgtB3z0wmio+zYo1Pk0lLj5fkhU+NzwnPqaDUTsjsRc+Lts7vhUAYz70z0U8YCDCPRqELrzkv5k9ibrMvSV+Rb1TQKW97hgdPtrTIb6Zzy0+A1JEvgq9wD0ATcg8YydHvqwyGj7cuOs83AwyvQso67wtBf28reqIvVsTy71faTm+raGCvWdEgL1JTc08PYEdPk7OzLypDby89X+ivNR7s7xZtMI7q0oWPvARNr4/mjm+F9rlPCzSa76NIrU9mLXWvXADBT18XpC+NUEZvjXUmz2eKsC9R/2EvkfS3D3uAP49pC4yPcYQM74xLcQ9671cPQopiT5ItJM9RY7XPYDWHD5SLPC8rYi4vcKppLye11Y7xP4vvfGOt73WNSI9QnnLvZkMCT7blEE+EzdTvo1nYL5ZhB+9eylXvn9XO74WzVw+ar74vTeOzj2Kb7C7MMI5PVKgSD6x/bC9GYG4PHCKGD6URp89Bn6dvVDoojxk5qe93g2+PRZoCj4AJVi+hgozvnauVL71Iho+9FlLvULYaTzS1tM9QFQ+PvQE271z9i69b2svPckT2T2f6ga8EJWKvsuYjj3p4+Y8ed3YPeAbmjcqeKQ8Wyn6vTlHz71GzE0+nRVAPlbiJL5S8F4+PcCAPtr3Br6R9lm+yhX1vX/PjT6lzYg99yxavqRwAj4/d4+9ny29PWbHdjt1Pbe9CoBFPtsltruDmpc71bi2vVQSJj6iav29gt0NvmrQT7y5UaY9kDunvL6X5LwS9cy9hVAbvgEgNL7M1Ky9RyjavOJryr0+tgy+7lYOPnitrj3LePs9U0TGPclpN7rZK5y9GWapPakccj2UDdy8qh4ePsmkBr4J0J29tVefPcMwjL1D3c07fkgEvbxlTr24ZPW9wNcKPkuwTr3gQ/M9oPtjPfA+6r0SfTw8O0AzPj4LQr2H17G8VGS4OyJrKr3ZVC8+jF+PvRvBHT5UzP098aDdvS3dLz3sCRo+cUnPvc6lgb4AeF69IlqIPRplAb4u6Ay+rQWfPJJnQ72WluO8MycBPpgSSL7JrP+9juJHvQgePj4RMUw98UZoPZ/f4rzYqAI97GwbPRHBuDuwyeU8lZZYPoX0Jb0OKmS9RuadPg0iAb5/qHC+PZKDPftgSL3oR/O9HcYlPpThxz08kXi971Wovaw5Gz1zFgu+Z+cIvlb3oj27J2g974cHvvvdxjuQBY49GzYNPmTc/D1K8FW92vslvVDoiL1wqRC+qwCNvaf+pTwTzqQ9G2/Kvaabeb1L3O091UwKvk8iGLtAF3E8ch2UvVrgmzxFLrY90v45vbj7rL3EISQ8qfWdPdbFuj36vGw98XBBvrphPbyt2Ba+kcQ8vjYSJj4KR9+9B/9dvLyO0r1GJZW8viz+vUZYJD1+FW29qFQdPsqacj0weMW9wJw2vhp0xj2aoY+9PWB6vvnna70pxrW8UUOKvWBpnL5xvqo9HFlrPiUkaT67HMw8aRYovg9ah7w+TJA9gNcfPfBorb0srOe9XJCLO5xzar2YiHw94/lNPjCxAz55O1s9/pW8vakmET3MrzA+HQuHvBlXlb5o9vk9m3efPnQXGD6lNli9lEPHvV86Oj0gmf294r6zvVYh4DtKYai7AYY5vif+wD2Kyry9Qsr1O/qj8b3rR4M7R4KQPds4Gz0Nj3c9euwLPoHtIT5hCVq+7kGiPQZKqz3iIXS76Z4Nvmu4OT5sq5w9qwVaPqApTbyZBX68L9GBPf+9hT75lis+D0AJPqUnCL42cO+9DEuhPa6zzzy3vNY9DouPPHyeyr15KBi+yOhXun9JRT5D1du9xTtrPUdjRT3dV/I9ZSf8PXRfC76/e5Q9XKFqvoadcDsEUt497Wq4PrGp5TvMAhq+ebmVvY2gt7w3gWc+AFtnvO+3CD3oQla9mzQMvWO30TtcWtA9TjErPtSZRzsV6Os9HtSSviC7gD5Xye28zwOJPSxKLz0J4w+94d6yO/Bitb10CNE7CMcHPiqLp70eQhE+04qnPiF1VT5mhCg+bZc/PhPCpL7zeBi+A4FuvptqDL7NFUu+QAJDvktQVjxC1gq8ENEmPu2jUT1YVjI+2Ejcvaz3473cQzW+Aqm3Or+roj0shSW9+ZbYvW46Oz3E8Ue9onkHvr09njxHLY0+EG8vPuGcUj3dkhO9mPxzPigoRj6GFZA857dEvvkhoz0E1VC+kfKPvjWdXb6H8V++CikDPmQ5bb1ioT6+kllKPVR/0D1fH9y90pQTPMv+lL7KNT8+QIcovRkRfz2V4VY9x9BGvpKs873Oe8g8u1BLvqVakz30O4i+UgwqvTMOcb7e25m9fi9EvrT+ib4+U0M8FQaAPR0Kir6dobK6nLk2vt3mhz4hydQ9OeAiPpRNCL5ojmk+g1qovKBJyjs8Ag09ewusPVHFRr0tzBu+HskYPkjdZr4OdEk+2UvGvUS5F77a9wy+ZFoIvq20XL7c3fQ9de5IPvmh1z39d6a8jEpxPiOUmL1Y3vu9gGO1vSdnnTx0Dxi+MK+cPQKAtb3fws89DplsvXGIVD7pCoK9D3y9vJBPyr3E86k881nOvLTrtrw7kLC995qFPtDpCL3AcIm+G9FzvYNCqb0qxqA9vuW0vkG1Er2H7rK8L+7fvR2977uFrxi+FczTvSgxAz7tzvM9ZjAPvdDOwr6KFjw+AjOGPYsJwb4T/CW+2iTVPeOY1D29ucu+cZzhvXGrCD3nUvc93U3Tvd2r573NuMQ99kEcvdTwMT4Ip+s4IaejvaDlGj5m7PU9vQ5YOr97m76pg3a+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_1/conv2d_2/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential_1/conv2d_2/Conv2D/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "sequential_1/conv2d_2/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "apTmPNyup70fy329ww8OPQ6ywbzrCks98lo0vdzKfL3u+GG9qBy6vTRM/zvWyDS9msKVvEEEhLzo55291wLyvIt6mr17boo9E6lLvWyeYTwqocO96k4NvZ/+DD05zHg8TX6ivGq1izzE8hW9NH+9u3diN701Q+e8C8UDvorWnb1qNgk9n6pIPa1UOzx2wDy9kG+QOjOgWL1byYQ8aMyQvNkQALzvJ6K8jGUdvfbZ3DrGC7a9ztzVvSibEju1ZJu782Mave7hNjx1GvC7UESjvNbVyLxLmIK7zr4JPZOz6LxSjG49qp6DPP6vSrzumvu9Y7QFvbSpmDvmjHC9xyVcvCWemDyXFo28N06avfokI71plwe9bAFvPMDF4r0VxBo79AaCPNr4lbu4awA9XqxQvUUuJLyzkm48k3hqPegdorzmSk287R50vEemLb0dY2i8F+xOvVdq1TycRQW+vROcvahli7xMTIO87tSRvO+FHryoelY9xkGlvYpoI7zuI/k7wR+LvTxeI70e6WK8mssIvNMM8jsPtUq7DFX4OLq68Ly0akq9IMiQvRdcRD3o1mS8wGSTvCYOqr1VEda86ggcPKF+C7yr44O9FC8evfLmir1EMJm97XXPvShOZDwbBz69MCWXvD5W8LvQ+Fa9qNCOvY4vjjz4M6i850//vMTmXL0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_1/conv2d_2/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["sequential_1/conv2d_2/Conv2D", "sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Relu", "op": "Relu", "input": ["sequential_1/conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_3/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 